gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/*
--------------------------------------------------------------------------
SIMULATOR - Simulator
--------------------------------------------------------------------------
*/

/* Simulator  */
typedef struct SIMULATOR_struct
{
    register8_t SIMCTRL0;  /* Simulator Control Register 0 */
    register8_t SIMCTRL1;  /* Simulator Control Register 1 */
} SIMULATOR_t;


/*
--------------------------------------------------------------------------
SLEEP - Sleep Controller
--------------------------------------------------------------------------
*/

/* Sleep Controller */
typedef struct SLEEP_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t reserved_1[1];
} SLEEP_t;

/* Sleep Mode */
typedef enum SLEEP_SMODE_enum
{
    SLEEP_SMODE_IDLE_gc = (0x00<<1),  /* Idle mode */
    SLEEP_SMODE_PSAVE_gc = (0x01<<1),  /* Power-save Mode */
} SLEEP_SMODE_t;

#define SLEEP_MODE_IDLE (0x00<<1)
#define SLEEP_MODE_PWR_SAVE (0x01<<1)
/*
--------------------------------------------------------------------------
STYLUSCOMIFV2 - Stylus Comif V2
--------------------------------------------------------------------------
*/

/* Stylus Comif V2 */
typedef struct STYLUSCOMIFV2_struct
{
    register8_t ANA_CTRLA;  /* Analog Control Register A */
    register8_t ANA_CTRLB;  /* Analog Control Register B */
    register8_t ANA_CTRLC;  /* Analog Control Register C */
    register8_t ANA_CTRLD;  /* Analog Control Register D */
    register8_t ANA_CTRLE;  /* Analog Control Register E */
    register8_t ANA_CTRLF;  /* Analog Control Register F */
    register8_t reserved_1[1];
    register8_t TMCTRLA;  /* Test Mode Control Register A */
    register8_t TMCTRLB;  /* Test Mode Control Register B */
    register8_t TMCTRLC;  /* Test Mode Control Register C */
    register8_t RX_MODE;  /* RX Mode */
    register8_t RX_CTRLA;  /* RX Control Register A */
    register8_t RX_CTRLB;  /* RX Control Register B */
    register8_t DLYLINE0CTRLA;  /* Delay Line 0 Control Register A */
    register8_t DLYLINE0CTRLB;  /* Delay Line 0 Control Register B */
    register8_t DLYLINE0CTRLC;  /* Delay Line 0 Control Register C */
    register8_t DLYLINE1CTRLA;  /* Delay Line 1 Control Register A */
    register8_t DLYLINE1CTRLB;  /* Delay Line 1 Control Register B */
    register8_t DLYLINE1CTRLC;  /* Delay Line 1 Control Register C */
    register8_t DLYLINE2CTRLA;  /* Delay Line 2 Control Register A */
    register8_t DLYLINE2CTRLB;  /* Delay Line 2 Control Register B */
    register8_t DLYLINE2CTRLC;  /* Delay Line 2 Control Register C */
    register8_t DLYLINE_SIGN;  /* Delay Line Sign Register C */
    register8_t XCORRCTRLA;  /* Cross-Correlator Control Register A */
    register8_t XCORRCTRLB;  /* Cross-Correlator Control Register B */
    register8_t XCORRCTRLC;  /* Cross-Correlator Control Register C */
    register8_t TIMACCUL;  /* Timer Accumulator */
    register8_t TIMACCUH;  /* Timer Accumulator */
    register8_t ACCUCNT;  /* Accumulator Count */
    register8_t TXCTRLA;  /* TX Control Register A */
    register8_t TXCTRLB;  /* TX Control Register B */
    register8_t TDS;  /* Transmit Data Size */
    register8_t TCNT;  /* Transmit Counter */
    register8_t TDLYINIT;  /* Transmit Delay Initial Value */
    register8_t TDLYCLAMP;  /* Transmit Delay Clamp for Receiver Clamp Tip */
    register8_t TDLYRXDIS;  /* Transmit Delay for Receiver Disable */
    register8_t TDLYCNT;  /* Transmit Delay Counter */
    register8_t TRCNT;  /* Transmit Repeat Counter */
    register8_t TXREP;  /* Transmit Repeat Counter */
    register8_t TXTIMCTRLA;  /* TX Timer Control A */
    register8_t TXTIMCTRLB;  /* TX Timer Control B */
    register8_t TXDATA0;  /* Transmit Data Register 0 */
    register8_t TXDATA1;  /* Transmit Data Register 1 */
    register8_t TXDATA2;  /* Transmit Data Register 2 */
    register8_t TXDATA3;  /* Transmit Data Register 3 */
    register8_t TXDATA4;  /* Transmit Data Register 4 */
    register8_t TXDATA5;  /* Transmit Data Register 5 */
    register8_t TXDATA6;  /* Transmit Data Register 6 */
    register8_t TXDATA7;  /* Transmit Data Register 7 */
    register8_t TX_STROBE;  /* Transmit Strobe Register */
    register8_t INTCTRLA;  /* Interrupt Control Register A */
    register8_t INTCTRLB;  /* Interrupt Control Register B */
    register8_t INTCTRLC;  /* Interrupt Control Register C */
    register8_t INTFLAGS;  /* Interrupt Flags Register */
    register8_t INTFLAG_FREQ;  /* Interrupt Flag Frequency interrupt Register */
    register8_t STATUS;  /* Status */
    register8_t WAKE_CTRLA;  /* Wake-up Control Register A */
    register8_t WAKE_CTRLB;  /* Wake-up Control Register B */
    register8_t WAKE_CTRLC;  /* Wake-up Control Register C */
    register8_t WAKE_CTRLD;  /* Wake-up Control Register D */
    register8_t reserved_2[1];
    register8_t TX_SOURCE;  /* Transmitter source */
    register8_t ANA_SAT_CTRL;  /* Analog saturation module control */
    register8_t TEMP;  /* Temporary Register */
} STYLUSCOMIFV2_t;


/*
--------------------------------------------------------------------------
TIM8_16 - Timer 8/16 bit
--------------------------------------------------------------------------
*/

/* Timer 8/16 bit */
typedef struct TIM8_16_struct
{
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t INTMSK;  /* Interrupt Mask Register */
    register8_t STATUS;  /* Status Register */
    register8_t TEMP;  /* Temporary Register */
    register8_t reserved_1[3];
    register8_t COUNTL;  /* Count Register Low Byte */
    register8_t COUNTH;  /* Count Register High Byte */
    register8_t OCRA;  /* Output Compare Register A */
    register8_t OCRB;  /* Output Compare Register B */
    register8_t reserved_2[4];
} TIM8_16_t;

/* Clock Select */
typedef enum TIM8_16_CS_enum
{
    TIM8_16_CS_STOPPED_gc = (0x00<<0),  /* No clock selected */
    TIM8_16_CS_CLKIO_gc = (0x01<<0),  /* clkIO - No prescaling */
    TIM8_16_CS_CLKIO_DIV8_gc = (0x02<<0),  /* clkIO/8 from prescaling */
    TIM8_16_CS_CLKIO_DIV64_gc = (0x03<<0),  /* clkIO/64 from prescaling */
    TIM8_16_CS_CLKIO_DIV256_gc = (0x04<<0),  /* clkIO/256 from prescaling */
    TIM8_16_CS_CLKIO_DIV1024_gc = (0x05<<0),  /* clkIO/1024 from prescaling */
    TIM8_16_CS_8U6_gc = (0x06<<0),  /* 8us clock selected */
    TIM8_16_CS_16U_gc = (0x07<<0),  /* 16us clock selected */
    TIM8_16_CS_64U_gc = (0x08<<0),  /* 64us clock selected */
    TIM8_16_CS_256U_gc = (0x09<<0),  /* 256us clock selected */
    TIM8_16_CS_1M_gc = (0x0A<<0),  /* 1ms clock selected */
    TIM8_16_CS_4M_gc = (0x0B<<0),  /* 4ms clock selected */
    TIM8_16_CS_16M_gc = (0x0C<<0),  /* 16ms clock selected */
    TIM8_16_CS_65M_gc = (0x0D<<0),  /* 65ms clock selected */
    TIM8_16_CS_262M_gc = (0x0E<<0),  /* 262ms clock selected */
    TIM8_16_CS_1S_gc = (0x0F<<0),  /* 1s clock selected */
} TIM8_16_CS_t;

