gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* VPORT (VPORT1) - Virtual Port */
#define VPORT1_DIR  _SFR_MEM8(0x0014)
#define VPORT1_OUT  _SFR_MEM8(0x0015)
#define VPORT1_IN  _SFR_MEM8(0x0016)
#define VPORT1_INTFLAGS  _SFR_MEM8(0x0017)


/* VPORT (VPORT2) - Virtual Port */
#define VPORT2_DIR  _SFR_MEM8(0x0018)
#define VPORT2_OUT  _SFR_MEM8(0x0019)
#define VPORT2_IN  _SFR_MEM8(0x001A)
#define VPORT2_INTFLAGS  _SFR_MEM8(0x001B)


/* VPORT (VPORT3) - Virtual Port */
#define VPORT3_DIR  _SFR_MEM8(0x001C)
#define VPORT3_OUT  _SFR_MEM8(0x001D)
#define VPORT3_IN  _SFR_MEM8(0x001E)
#define VPORT3_INTFLAGS  _SFR_MEM8(0x001F)


/* OCD - On-Chip Debug System */
#define OCD_OCDR0  _SFR_MEM8(0x002E)
#define OCD_OCDR1  _SFR_MEM8(0x002F)


/* CPU - CPU registers */
#define CPU_CCP  _SFR_MEM8(0x0034)
#define CPU_RAMPD  _SFR_MEM8(0x0038)
#define CPU_RAMPX  _SFR_MEM8(0x0039)
#define CPU_RAMPY  _SFR_MEM8(0x003A)
#define CPU_RAMPZ  _SFR_MEM8(0x003B)
#define CPU_EIND  _SFR_MEM8(0x003C)
#define CPU_SPL  _SFR_MEM8(0x003D)
#define CPU_SPH  _SFR_MEM8(0x003E)
#define CPU_SREG  _SFR_MEM8(0x003F)


/* SLEEP - Sleep Controller */
#define SLEEP_CTRL  _SFR_MEM8(0x0040)


/* BOD - Bod */
#define BOD_BODLEVEL  _SFR_MEM8(0x0043)


/* RST - Reset */
#define RST_STATUS  _SFR_MEM8(0x0044)
#define RST_CTRL  _SFR_MEM8(0x0045)


/* BANDGAP - Bandgap */
#define BANDGAP_CTRL  _SFR_MEM8(0x0048)
#define BANDGAP_CAL  _SFR_MEM8(0x0049)


/* BIASCTRL - BIASCTRL */
#define BIASCTRL_CTRL  _SFR_MEM8(0x004A)


/* LDO - LDO */
#define LDO_CTRL  _SFR_MEM8(0x004C)
#define LDO_CAL  _SFR_MEM8(0x004D)


/* CLK - Clock System */
#define CLK_CLKPSR  _SFR_MEM8(0x0050)
#define CLK_CLKSLR  _SFR_MEM8(0x0051)
#define CLK_FRCCALL  _SFR_MEM8(0x0054)
#define CLK_FRCCALH  _SFR_MEM8(0x0055)
#define CLK_ULPRCCALL  _SFR_MEM8(0x0056)
#define CLK_ULPRCCALH  _SFR_MEM8(0x0057)
#define CLK_OSCTST  _SFR_MEM8(0x0058)


/* WDT - Watch-Dog Timer */
#define WDT_CTRL  _SFR_MEM8(0x0080)
#define WDT_WINCTRL  _SFR_MEM8(0x0081)
#define WDT_STATUS  _SFR_MEM8(0x0082)


/* MCU - MCU Control */
#define MCU_DEVID0  _SFR_MEM8(0x0090)
#define MCU_DEVID1  _SFR_MEM8(0x0091)
#define MCU_DEVID2  _SFR_MEM8(0x0092)
#define MCU_REVID  _SFR_MEM8(0x0093)


/* PMIC - Programmable Multi-level Interrupt Controller */
#define PMIC_STATUS  _SFR_MEM8(0x00A0)
#define PMIC_INTPRI  _SFR_MEM8(0x00A1)
#define PMIC_CTRL  _SFR_MEM8(0x00A2)


/* WUT - Wake-up Timer */
#define WUT_CTRL  _SFR_MEM8(0x00C0)
#define WUT_INTCTRL  _SFR_MEM8(0x00C1)
#define WUT_STATUS  _SFR_MEM8(0x00C2)


/* CRC4 - Cyclic Redundancy Checker */
#define CRC4_DATAIN  _SFR_MEM8(0x00C4)
#define CRC4_CHECKSUM  _SFR_MEM8(0x00C5)


/* TSTACC - Test Access Control */
#define TSTACC_SIGNATURE  _SFR_MEM8(0x00C8)
#define TSTACC_STATUS  _SFR_MEM8(0x00C9)


/* NVM - Non-volatile Memory Controller */
#define NVM_ADDR0  _SFR_MEM8(0x01C0)
#define NVM_ADDR1  _SFR_MEM8(0x01C1)
#define NVM_ADDR2  _SFR_MEM8(0x01C2)
#define NVM_DATA0  _SFR_MEM8(0x01C4)
#define NVM_DATA1  _SFR_MEM8(0x01C5)
#define NVM_DATA2  _SFR_MEM8(0x01C6)
#define NVM_CMD  _SFR_MEM8(0x01CA)
#define NVM_CTRLA  _SFR_MEM8(0x01CB)
#define NVM_CTRLB  _SFR_MEM8(0x01CC)
#define NVM_INTCTRL  _SFR_MEM8(0x01CD)
#define NVM_STATUS  _SFR_MEM8(0x01CF)
#define NVM_LOCKBITS  _SFR_MEM8(0x01D0)


/* BOOSTIF - Boost Converter Interface */
#define BOOSTIF_CTRLA  _SFR_MEM8(0x03D8)
#define BOOSTIF_CTRLB  _SFR_MEM8(0x03D9)
#define BOOSTIF_LEVEL  _SFR_MEM8(0x03DA)
#define BOOSTIF_CNTHIGH  _SFR_MEM8(0x03DB)
#define BOOSTIF_CNTLOW  _SFR_MEM8(0x03DC)
#define BOOSTIF_TEST  _SFR_MEM8(0x03DD)
#define BOOSTIF_SETTLE  _SFR_MEM8(0x03DE)


/* PWRCTRL - VS PM Control Interface */
#define PWRCTRL_PWRCRVDD2  _SFR_MEM8(0x03E4)


/* TWI (TWIC) - Two-Wire Interface */
#define TWIC_CTRL  _SFR_MEM8(0x03F0)
#define TWIC_MASTER_CTRLA  _SFR_MEM8(0x03F1)
#define TWIC_MASTER_CTRLB  _SFR_MEM8(0x03F2)
#define TWIC_MASTER_CTRLC  _SFR_MEM8(0x03F3)
#define TWIC_MASTER_STATUS  _SFR_MEM8(0x03F4)
#define TWIC_MASTER_BAUD  _SFR_MEM8(0x03F5)
#define TWIC_MASTER_ADDR  _SFR_MEM8(0x03F6)
#define TWIC_MASTER_DATA  _SFR_MEM8(0x03F7)


#define TWIC_SLAVE_CTRLA  _SFR_MEM8(0x03F8)
#define TWIC_SLAVE_CTRLB  _SFR_MEM8(0x03F9)
#define TWIC_SLAVE_STATUS  _SFR_MEM8(0x03FA)
#define TWIC_SLAVE_ADDR  _SFR_MEM8(0x03FB)
#define TWIC_SLAVE_DATA  _SFR_MEM8(0x03FC)
#define TWIC_SLAVE_ADDRMASK  _SFR_MEM8(0x03FD)




/* TIM8_16 (TIMER0) - Timer 8/16 bit */
#define TIMER0_CTRLA  _SFR_MEM8(0x0400)
#define TIMER0_CTRLB  _SFR_MEM8(0x0401)
#define TIMER0_INTMSK  _SFR_MEM8(0x0402)
#define TIMER0_STATUS  _SFR_MEM8(0x0403)
#define TIMER0_TEMP  _SFR_MEM8(0x0404)
#define TIMER0_COUNTL  _SFR_MEM8(0x0408)
#define TIMER0_COUNTH  _SFR_MEM8(0x0409)
#define TIMER0_OCRA  _SFR_MEM8(0x040A)
#define TIMER0_OCRB  _SFR_MEM8(0x040B)


/* TIM8_16 (TIMER1) - Timer 8/16 bit */
#define TIMER1_CTRLA  _SFR_MEM8(0x0410)
#define TIMER1_CTRLB  _SFR_MEM8(0x0411)
#define TIMER1_INTMSK  _SFR_MEM8(0x0412)
#define TIMER1_STATUS  _SFR_MEM8(0x0413)
#define TIMER1_TEMP  _SFR_MEM8(0x0414)
#define TIMER1_COUNTL  _SFR_MEM8(0x0418)
#define TIMER1_COUNTH  _SFR_MEM8(0x0419)
#define TIMER1_OCRA  _SFR_MEM8(0x041A)
#define TIMER1_OCRB  _SFR_MEM8(0x041B)


/* TIMPRESC - Timer Prescaler */
#define TIMPRESC_PRESC  _SFR_MEM8(0x0420)


/* STYLUSCOMIFV2 (STYLUSCOM) - Stylus Comif V2 */
#define STYLUSCOM_ANA_CTRLA  _SFR_MEM8(0x0440)
#define STYLUSCOM_ANA_CTRLB  _SFR_MEM8(0x0441)
#define STYLUSCOM_ANA_CTRLC  _SFR_MEM8(0x0442)
#define STYLUSCOM_ANA_CTRLD  _SFR_MEM8(0x0443)
#define STYLUSCOM_ANA_CTRLE  _SFR_MEM8(0x0444)
#define STYLUSCOM_ANA_CTRLF  _SFR_MEM8(0x0445)
#define STYLUSCOM_TMCTRLA  _SFR_MEM8(0x0447)
#define STYLUSCOM_TMCTRLB  _SFR_MEM8(0x0448)
#define STYLUSCOM_TMCTRLC  _SFR_MEM8(0x0449)
#define STYLUSCOM_RX_MODE  _SFR_MEM8(0x044A)
#define STYLUSCOM_RX_CTRLA  _SFR_MEM8(0x044B)
#define STYLUSCOM_RX_CTRLB  _SFR_MEM8(0x044C)
#define STYLUSCOM_DLYLINE0CTRLA  _SFR_MEM8(0x044D)
#define STYLUSCOM_DLYLINE0CTRLB  _SFR_MEM8(0x044E)
#define STYLUSCOM_DLYLINE0CTRLC  _SFR_MEM8(0x044F)
#define STYLUSCOM_DLYLINE1CTRLA  _SFR_MEM8(0x0450)
#define STYLUSCOM_DLYLINE1CTRLB  _SFR_MEM8(0x0451)
#define STYLUSCOM_DLYLINE1CTRLC  _SFR_MEM8(0x0452)
#define STYLUSCOM_DLYLINE2CTRLA  _SFR_MEM8(0x0453)
#define STYLUSCOM_DLYLINE2CTRLB  _SFR_MEM8(0x0454)
#define STYLUSCOM_DLYLINE2CTRLC  _SFR_MEM8(0x0455)
#define STYLUSCOM_DLYLINE_SIGN  _SFR_MEM8(0x0456)
#define STYLUSCOM_XCORRCTRLA  _SFR_MEM8(0x0457)
#define STYLUSCOM_XCORRCTRLB  _SFR_MEM8(0x0458)
#define STYLUSCOM_XCORRCTRLC  _SFR_MEM8(0x0459)
#define STYLUSCOM_TIMACCUL  _SFR_MEM8(0x045A)
#define STYLUSCOM_TIMACCUH  _SFR_MEM8(0x045B)
#define STYLUSCOM_ACCUCNT  _SFR_MEM8(0x045C)
#define STYLUSCOM_TXCTRLA  _SFR_MEM8(0x045D)
#define STYLUSCOM_TXCTRLB  _SFR_MEM8(0x045E)
#define STYLUSCOM_TDS  _SFR_MEM8(0x045F)
#define STYLUSCOM_TCNT  _SFR_MEM8(0x0460)
#define STYLUSCOM_TDLYINIT  _SFR_MEM8(0x0461)
#define STYLUSCOM_TDLYCLAMP  _SFR_MEM8(0x0462)
#define STYLUSCOM_TDLYRXDIS  _SFR_MEM8(0x0463)
#define STYLUSCOM_TDLYCNT  _SFR_MEM8(0x0464)
#define STYLUSCOM_TRCNT  _SFR_MEM8(0x0465)
#define STYLUSCOM_TXREP  _SFR_MEM8(0x0466)
#define STYLUSCOM_TXTIMCTRLA  _SFR_MEM8(0x0467)
#define STYLUSCOM_TXTIMCTRLB  _SFR_MEM8(0x0468)
#define STYLUSCOM_TXDATA0  _SFR_MEM8(0x0469)
#define STYLUSCOM_TXDATA1  _SFR_MEM8(0x046A)
#define STYLUSCOM_TXDATA2  _SFR_MEM8(0x046B)
#define STYLUSCOM_TXDATA3  _SFR_MEM8(0x046C)
#define STYLUSCOM_TXDATA4  _SFR_MEM8(0x046D)
#define STYLUSCOM_TXDATA5  _SFR_MEM8(0x046E)
#define STYLUSCOM_TXDATA6  _SFR_MEM8(0x046F)
#define STYLUSCOM_TXDATA7  _SFR_MEM8(0x0470)
#define STYLUSCOM_TX_STROBE  _SFR_MEM8(0x0471)
#define STYLUSCOM_INTCTRLA  _SFR_MEM8(0x0472)
#define STYLUSCOM_INTCTRLB  _SFR_MEM8(0x0473)
#define STYLUSCOM_INTCTRLC  _SFR_MEM8(0x0474)
#define STYLUSCOM_INTFLAGS  _SFR_MEM8(0x0475)
#define STYLUSCOM_INTFLAG_FREQ  _SFR_MEM8(0x0476)
#define STYLUSCOM_STATUS  _SFR_MEM8(0x0477)
#define STYLUSCOM_WAKE_CTRLA  _SFR_MEM8(0x0478)
#define STYLUSCOM_WAKE_CTRLB  _SFR_MEM8(0x0479)
#define STYLUSCOM_WAKE_CTRLC  _SFR_MEM8(0x047A)
#define STYLUSCOM_WAKE_CTRLD  _SFR_MEM8(0x047B)
#define STYLUSCOM_TX_SOURCE  _SFR_MEM8(0x047D)
#define STYLUSCOM_ANA_SAT_CTRL  _SFR_MEM8(0x047E)
#define STYLUSCOM_TEMP  _SFR_MEM8(0x047F)


/* PORT (PORTA) - I/O Ports */
#define PORTA_DIR  _SFR_MEM8(0x0480)
#define PORTA_OUT  _SFR_MEM8(0x0484)
#define PORTA_IN  _SFR_MEM8(0x0488)
#define PORTA_INTCTRL  _SFR_MEM8(0x0489)
#define PORTA_INT0MASK  _SFR_MEM8(0x048A)
#define PORTA_INT1MASK  _SFR_MEM8(0x048B)
#define PORTA_INTFLAGS  _SFR_MEM8(0x048C)
#define PORTA_PIN0CTRL  _SFR_MEM8(0x0490)
#define PORTA_PIN1CTRL  _SFR_MEM8(0x0491)
#define PORTA_PIN2CTRL  _SFR_MEM8(0x0492)
#define PORTA_PIN3CTRL  _SFR_MEM8(0x0493)
#define PORTA_PIN4CTRL  _SFR_MEM8(0x0494)
#define PORTA_PIN5CTRL  _SFR_MEM8(0x0495)
#define PORTA_PIN6CTRL  _SFR_MEM8(0x0496)
#define PORTA_PIN7CTRL  _SFR_MEM8(0x0497)


/* PORT (PORTB) - I/O Ports */
#define PORTB_DIR  _SFR_MEM8(0x04A0)
#define PORTB_OUT  _SFR_MEM8(0x04A4)
#define PORTB_IN  _SFR_MEM8(0x04A8)
#define PORTB_INTCTRL  _SFR_MEM8(0x04A9)
#define PORTB_INT0MASK  _SFR_MEM8(0x04AA)
#define PORTB_INT1MASK  _SFR_MEM8(0x04AB)
#define PORTB_INTFLAGS  _SFR_MEM8(0x04AC)
#define PORTB_PIN0CTRL  _SFR_MEM8(0x04B0)
#define PORTB_PIN1CTRL  _SFR_MEM8(0x04B1)
#define PORTB_PIN2CTRL  _SFR_MEM8(0x04B2)
#define PORTB_PIN3CTRL  _SFR_MEM8(0x04B3)
#define PORTB_PIN4CTRL  _SFR_MEM8(0x04B4)
#define PORTB_PIN5CTRL  _SFR_MEM8(0x04B5)
#define PORTB_PIN6CTRL  _SFR_MEM8(0x04B6)
#define PORTB_PIN7CTRL  _SFR_MEM8(0x04B7)


