gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* PORT (PORTC) - I/O Ports */
#define PORTC_DIR  _SFR_MEM8(0x04C0)
#define PORTC_OUT  _SFR_MEM8(0x04C4)
#define PORTC_IN  _SFR_MEM8(0x04C8)
#define PORTC_INTCTRL  _SFR_MEM8(0x04C9)
#define PORTC_INT0MASK  _SFR_MEM8(0x04CA)
#define PORTC_INT1MASK  _SFR_MEM8(0x04CB)
#define PORTC_INTFLAGS  _SFR_MEM8(0x04CC)
#define PORTC_PIN0CTRL  _SFR_MEM8(0x04D0)
#define PORTC_PIN1CTRL  _SFR_MEM8(0x04D1)
#define PORTC_PIN2CTRL  _SFR_MEM8(0x04D2)
#define PORTC_PIN3CTRL  _SFR_MEM8(0x04D3)
#define PORTC_PIN4CTRL  _SFR_MEM8(0x04D4)
#define PORTC_PIN5CTRL  _SFR_MEM8(0x04D5)
#define PORTC_PIN6CTRL  _SFR_MEM8(0x04D6)
#define PORTC_PIN7CTRL  _SFR_MEM8(0x04D7)


/* PULLDOWN - Pulldown */
#define PULLDOWN_PDCTRLC  _SFR_MEM8(0x0500)


/* ADC_CMN - ADC Common Settings */
#define ADCCMN_CTRLA  _SFR_MEM8(0x0800)
#define ADCCMN_CTRLB  _SFR_MEM8(0x0801)
#define ADCCMN_EVSEL  _SFR_MEM8(0x0802)
#define ADCCMN_PORTCTRL  _SFR_MEM8(0x0803)
#define ADCCMN_PRESCALER  _SFR_MEM8(0x0804)
#define ADCCMN_INTCTRL  _SFR_MEM8(0x0806)
#define ADCCMN_INTSTATUS  _SFR_MEM8(0x0807)
#define ADCCMN_CHSTATUS  _SFR_MEM8(0x0808)
#define ADCCMN_THRESHOLD  _SFR_MEM8(0x0809)
#define ADCCMN_CAL  _SFR_MEM8(0x080C)
#define ADCCMN_TEST  _SFR_MEM8(0x080F)


/* ADC_GEN_CH - ADC General Channel */
#define ADCGENCH_CTRLA  _SFR_MEM8(0x0810)
#define ADCGENCH_SAMPCTRL  _SFR_MEM8(0x0811)
#define ADCGENCH_MUXCTRL  _SFR_MEM8(0x0812)
#define ADCGENCH_INTCTRL  _SFR_MEM8(0x0813)
#define ADCGENCH_INTSTATUS  _SFR_MEM8(0x0815)
#define ADCGENCH_RESL  _SFR_MEM8(0x0816)
#define ADCGENCH_RESH  _SFR_MEM8(0x0817)
#define ADCGENCH_REFCTRL  _SFR_MEM8(0x0818)
#define ADCGENCH_RESHTMP  _SFR_MEM8(0x0819)


/* SIMULATOR - Simulator  */
#define SIMULATOR_SIMCTRL0  _SFR_MEM8(0x0FF0)
#define SIMULATOR_SIMCTRL1  _SFR_MEM8(0x0FF1)



/*================== Bitfield Definitions ================== */

/* ADC_CMN - ADC Common Settings */
/* ADC_CMN.CTRLA  bit masks and bit positions */
#define ADC_CMN_SSEN_bm  0x01  /* Sensor settling enable bit mask. */
#define ADC_CMN_SSEN_bp  0  /* Sensor settling enable bit position. */
#define ADC_CMN_FLUSH_bm  0x02  /* Pipeline Flush bit mask. */
#define ADC_CMN_FLUSH_bp  1  /* Pipeline Flush bit position. */
#define ADC_CMN_ADCLDOBPEN_bm  0x04  /* ADC LDO Bypass Override Enable bit mask. */
#define ADC_CMN_ADCLDOBPEN_bp  2  /* ADC LDO Bypass Override Enable bit position. */
#define ADC_CMN_SSLDOBPEN_bm  0x08  /* Sensor settling LDO Bypass Override Enable bit mask. */
#define ADC_CMN_SSLDOBPEN_bp  3  /* Sensor settling LDO Bypass Override Enable bit position. */
#define ADC_CMN_TXEDGEDETEN_bm  0x20  /* Enable ADC-TX collision detector bit mask. */
#define ADC_CMN_TXEDGEDETEN_bp  5  /* Enable ADC-TX collision detector bit position. */
#define ADC_CMN_TXEDGEDETMODE_gm  0xC0  /* ADC-TX collision detector mode group mask. */
#define ADC_CMN_TXEDGEDETMODE_gp  6  /* ADC-TX collision detector mode group position. */
#define ADC_CMN_TXEDGEDETMODE0_bm  (1<<6)  /* ADC-TX collision detector mode bit 0 mask. */
#define ADC_CMN_TXEDGEDETMODE0_bp  6  /* ADC-TX collision detector mode bit 0 position. */
#define ADC_CMN_TXEDGEDETMODE1_bm  (1<<7)  /* ADC-TX collision detector mode bit 1 mask. */
#define ADC_CMN_TXEDGEDETMODE1_bp  7  /* ADC-TX collision detector mode bit 1 position. */

/* ADC_CMN.CTRLB  bit masks and bit positions */
#define ADC_CMN_ADCINIT_gm  0x1C  /* ADC initialization clock cycles group mask. */
#define ADC_CMN_ADCINIT_gp  2  /* ADC initialization clock cycles group position. */
#define ADC_CMN_ADCINIT0_bm  (1<<2)  /* ADC initialization clock cycles bit 0 mask. */
#define ADC_CMN_ADCINIT0_bp  2  /* ADC initialization clock cycles bit 0 position. */
#define ADC_CMN_ADCINIT1_bm  (1<<3)  /* ADC initialization clock cycles bit 1 mask. */
#define ADC_CMN_ADCINIT1_bp  3  /* ADC initialization clock cycles bit 1 position. */
#define ADC_CMN_ADCINIT2_bm  (1<<4)  /* ADC initialization clock cycles bit 2 mask. */
#define ADC_CMN_ADCINIT2_bp  4  /* ADC initialization clock cycles bit 2 position. */
#define ADC_CMN_CURRLIMIT_gm  0x60  /* Current Limitation group mask. */
#define ADC_CMN_CURRLIMIT_gp  5  /* Current Limitation group position. */
#define ADC_CMN_CURRLIMIT0_bm  (1<<5)  /* Current Limitation bit 0 mask. */
#define ADC_CMN_CURRLIMIT0_bp  5  /* Current Limitation bit 0 position. */
#define ADC_CMN_CURRLIMIT1_bm  (1<<6)  /* Current Limitation bit 1 mask. */
#define ADC_CMN_CURRLIMIT1_bp  6  /* Current Limitation bit 1 position. */

/* ADC_CMN.EVSEL  bit masks and bit positions */
#define ADC_CMN_SSTIMSEL_gm  0x07  /* Sensor settling time select group mask. */
#define ADC_CMN_SSTIMSEL_gp  0  /* Sensor settling time select group position. */
#define ADC_CMN_SSTIMSEL0_bm  (1<<0)  /* Sensor settling time select bit 0 mask. */
#define ADC_CMN_SSTIMSEL0_bp  0  /* Sensor settling time select bit 0 position. */
#define ADC_CMN_SSTIMSEL1_bm  (1<<1)  /* Sensor settling time select bit 1 mask. */
#define ADC_CMN_SSTIMSEL1_bp  1  /* Sensor settling time select bit 1 position. */
#define ADC_CMN_SSTIMSEL2_bm  (1<<2)  /* Sensor settling time select bit 2 mask. */
#define ADC_CMN_SSTIMSEL2_bp  2  /* Sensor settling time select bit 2 position. */
#define ADC_CMN_SCANTIMSEL_gm  0x30  /* ADC scan time select group mask. */
#define ADC_CMN_SCANTIMSEL_gp  4  /* ADC scan time select group position. */
#define ADC_CMN_SCANTIMSEL0_bm  (1<<4)  /* ADC scan time select bit 0 mask. */
#define ADC_CMN_SCANTIMSEL0_bp  4  /* ADC scan time select bit 0 position. */
#define ADC_CMN_SCANTIMSEL1_bm  (1<<5)  /* ADC scan time select bit 1 mask. */
#define ADC_CMN_SCANTIMSEL1_bp  5  /* ADC scan time select bit 1 position. */

/* ADC_CMN.PORTCTRL  bit masks and bit positions */
#define ADC_CMN_PSEL_gm  0x07  /* Port select group mask. */
#define ADC_CMN_PSEL_gp  0  /* Port select group position. */
#define ADC_CMN_PSEL0_bm  (1<<0)  /* Port select bit 0 mask. */
#define ADC_CMN_PSEL0_bp  0  /* Port select bit 0 position. */
#define ADC_CMN_PSEL1_bm  (1<<1)  /* Port select bit 1 mask. */
#define ADC_CMN_PSEL1_bp  1  /* Port select bit 1 position. */
#define ADC_CMN_PSEL2_bm  (1<<2)  /* Port select bit 2 mask. */
#define ADC_CMN_PSEL2_bp  2  /* Port select bit 2 position. */
#define ADC_CMN_POV_bm  0x10  /* Port override value bit mask. */
#define ADC_CMN_POV_bp  4  /* Port override value bit position. */

