gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* PMIC.CTRL  bit masks and bit positions */
#define PMIC_LOLVLEN_bm  0x01  /* Low Level Enable bit mask. */
#define PMIC_LOLVLEN_bp  0  /* Low Level Enable bit position. */
#define PMIC_MEDLVLEN_bm  0x02  /* Medium Level Enable bit mask. */
#define PMIC_MEDLVLEN_bp  1  /* Medium Level Enable bit position. */
#define PMIC_HILVLEN_bm  0x04  /* High Level Enable bit mask. */
#define PMIC_HILVLEN_bp  2  /* High Level Enable bit position. */
#define PMIC_IVSEL_bm  0x40  /* Interrupt Vector Select bit mask. */
#define PMIC_IVSEL_bp  6  /* Interrupt Vector Select bit position. */
#define PMIC_RREN_bm  0x80  /* Round-Robin Priority Enable bit mask. */
#define PMIC_RREN_bp  7  /* Round-Robin Priority Enable bit position. */

/* PORT - I/O Port Configuration */
/* PORT.DIR  bit masks and bit positions */
#define PORT_DIR_gm  0xFF  /* Data Direction group mask. */
#define PORT_DIR_gp  0  /* Data Direction group position. */
#define PORT_DIR0_bm  (1<<0)  /* Data Direction bit 0 mask. */
#define PORT_DIR0_bp  0  /* Data Direction bit 0 position. */
#define PORT_DIR1_bm  (1<<1)  /* Data Direction bit 1 mask. */
#define PORT_DIR1_bp  1  /* Data Direction bit 1 position. */
#define PORT_DIR2_bm  (1<<2)  /* Data Direction bit 2 mask. */
#define PORT_DIR2_bp  2  /* Data Direction bit 2 position. */
#define PORT_DIR3_bm  (1<<3)  /* Data Direction bit 3 mask. */
#define PORT_DIR3_bp  3  /* Data Direction bit 3 position. */
#define PORT_DIR4_bm  (1<<4)  /* Data Direction bit 4 mask. */
#define PORT_DIR4_bp  4  /* Data Direction bit 4 position. */
#define PORT_DIR5_bm  (1<<5)  /* Data Direction bit 5 mask. */
#define PORT_DIR5_bp  5  /* Data Direction bit 5 position. */
#define PORT_DIR6_bm  (1<<6)  /* Data Direction bit 6 mask. */
#define PORT_DIR6_bp  6  /* Data Direction bit 6 position. */
#define PORT_DIR7_bm  (1<<7)  /* Data Direction bit 7 mask. */
#define PORT_DIR7_bp  7  /* Data Direction bit 7 position. */

/* PORT.OUT  bit masks and bit positions */
#define PORT_OUT_gm  0xFF  /* Output Data group mask. */
#define PORT_OUT_gp  0  /* Output Data group position. */
#define PORT_OUT0_bm  (1<<0)  /* Output Data bit 0 mask. */
#define PORT_OUT0_bp  0  /* Output Data bit 0 position. */
#define PORT_OUT1_bm  (1<<1)  /* Output Data bit 1 mask. */
#define PORT_OUT1_bp  1  /* Output Data bit 1 position. */
#define PORT_OUT2_bm  (1<<2)  /* Output Data bit 2 mask. */
#define PORT_OUT2_bp  2  /* Output Data bit 2 position. */
#define PORT_OUT3_bm  (1<<3)  /* Output Data bit 3 mask. */
#define PORT_OUT3_bp  3  /* Output Data bit 3 position. */
#define PORT_OUT4_bm  (1<<4)  /* Output Data bit 4 mask. */
#define PORT_OUT4_bp  4  /* Output Data bit 4 position. */
#define PORT_OUT5_bm  (1<<5)  /* Output Data bit 5 mask. */
#define PORT_OUT5_bp  5  /* Output Data bit 5 position. */
#define PORT_OUT6_bm  (1<<6)  /* Output Data bit 6 mask. */
#define PORT_OUT6_bp  6  /* Output Data bit 6 position. */
#define PORT_OUT7_bm  (1<<7)  /* Output Data bit 7 mask. */
#define PORT_OUT7_bp  7  /* Output Data bit 7 position. */

/* PORT.IN  bit masks and bit positions */
#define PORT_IN_gm  0xFF  /* Input Data group mask. */
#define PORT_IN_gp  0  /* Input Data group position. */
#define PORT_IN0_bm  (1<<0)  /* Input Data bit 0 mask. */
#define PORT_IN0_bp  0  /* Input Data bit 0 position. */
#define PORT_IN1_bm  (1<<1)  /* Input Data bit 1 mask. */
#define PORT_IN1_bp  1  /* Input Data bit 1 position. */
#define PORT_IN2_bm  (1<<2)  /* Input Data bit 2 mask. */
#define PORT_IN2_bp  2  /* Input Data bit 2 position. */
#define PORT_IN3_bm  (1<<3)  /* Input Data bit 3 mask. */
#define PORT_IN3_bp  3  /* Input Data bit 3 position. */
#define PORT_IN4_bm  (1<<4)  /* Input Data bit 4 mask. */
#define PORT_IN4_bp  4  /* Input Data bit 4 position. */
#define PORT_IN5_bm  (1<<5)  /* Input Data bit 5 mask. */
#define PORT_IN5_bp  5  /* Input Data bit 5 position. */
#define PORT_IN6_bm  (1<<6)  /* Input Data bit 6 mask. */
#define PORT_IN6_bp  6  /* Input Data bit 6 position. */
#define PORT_IN7_bm  (1<<7)  /* Input Data bit 7 mask. */
#define PORT_IN7_bp  7  /* Input Data bit 7 position. */

/* PORT.INTCTRL  bit masks and bit positions */
#define PORT_INT0LVL_gm  0x03  /* Port Interrupt 0 Level group mask. */
#define PORT_INT0LVL_gp  0  /* Port Interrupt 0 Level group position. */
#define PORT_INT0LVL0_bm  (1<<0)  /* Port Interrupt 0 Level bit 0 mask. */
#define PORT_INT0LVL0_bp  0  /* Port Interrupt 0 Level bit 0 position. */
#define PORT_INT0LVL1_bm  (1<<1)  /* Port Interrupt 0 Level bit 1 mask. */
#define PORT_INT0LVL1_bp  1  /* Port Interrupt 0 Level bit 1 position. */
#define PORT_INT1LVL_gm  0x0C  /* Port Interrupt 1 Level group mask. */
#define PORT_INT1LVL_gp  2  /* Port Interrupt 1 Level group position. */
#define PORT_INT1LVL0_bm  (1<<2)  /* Port Interrupt 1 Level bit 0 mask. */
#define PORT_INT1LVL0_bp  2  /* Port Interrupt 1 Level bit 0 position. */
#define PORT_INT1LVL1_bm  (1<<3)  /* Port Interrupt 1 Level bit 1 mask. */
#define PORT_INT1LVL1_bp  3  /* Port Interrupt 1 Level bit 1 position. */

/* PORT.INT0MASK  bit masks and bit positions */
#define PORT_INT0MASK_gm  0xFF  /* Interrupt 0 Mask Register group mask. */
#define PORT_INT0MASK_gp  0  /* Interrupt 0 Mask Register group position. */
#define PORT_INT0MASK0_bm  (1<<0)  /* Interrupt 0 Mask Register bit 0 mask. */
#define PORT_INT0MASK0_bp  0  /* Interrupt 0 Mask Register bit 0 position. */
#define PORT_INT0MASK1_bm  (1<<1)  /* Interrupt 0 Mask Register bit 1 mask. */
#define PORT_INT0MASK1_bp  1  /* Interrupt 0 Mask Register bit 1 position. */
#define PORT_INT0MASK2_bm  (1<<2)  /* Interrupt 0 Mask Register bit 2 mask. */
#define PORT_INT0MASK2_bp  2  /* Interrupt 0 Mask Register bit 2 position. */
#define PORT_INT0MASK3_bm  (1<<3)  /* Interrupt 0 Mask Register bit 3 mask. */
#define PORT_INT0MASK3_bp  3  /* Interrupt 0 Mask Register bit 3 position. */
#define PORT_INT0MASK4_bm  (1<<4)  /* Interrupt 0 Mask Register bit 4 mask. */
#define PORT_INT0MASK4_bp  4  /* Interrupt 0 Mask Register bit 4 position. */
#define PORT_INT0MASK5_bm  (1<<5)  /* Interrupt 0 Mask Register bit 5 mask. */
#define PORT_INT0MASK5_bp  5  /* Interrupt 0 Mask Register bit 5 position. */
#define PORT_INT0MASK6_bm  (1<<6)  /* Interrupt 0 Mask Register bit 6 mask. */
#define PORT_INT0MASK6_bp  6  /* Interrupt 0 Mask Register bit 6 position. */
#define PORT_INT0MASK7_bm  (1<<7)  /* Interrupt 0 Mask Register bit 7 mask. */
#define PORT_INT0MASK7_bp  7  /* Interrupt 0 Mask Register bit 7 position. */

/* PORT.INT1MASK  bit masks and bit positions */
#define PORT_INT1MASK_gm  0xFF  /* Interrupt 1 Mask Register group mask. */
#define PORT_INT1MASK_gp  0  /* Interrupt 1 Mask Register group position. */
#define PORT_INT1MASK0_bm  (1<<0)  /* Interrupt 1 Mask Register bit 0 mask. */
#define PORT_INT1MASK0_bp  0  /* Interrupt 1 Mask Register bit 0 position. */
#define PORT_INT1MASK1_bm  (1<<1)  /* Interrupt 1 Mask Register bit 1 mask. */
#define PORT_INT1MASK1_bp  1  /* Interrupt 1 Mask Register bit 1 position. */
#define PORT_INT1MASK2_bm  (1<<2)  /* Interrupt 1 Mask Register bit 2 mask. */
#define PORT_INT1MASK2_bp  2  /* Interrupt 1 Mask Register bit 2 position. */
#define PORT_INT1MASK3_bm  (1<<3)  /* Interrupt 1 Mask Register bit 3 mask. */
#define PORT_INT1MASK3_bp  3  /* Interrupt 1 Mask Register bit 3 position. */
#define PORT_INT1MASK4_bm  (1<<4)  /* Interrupt 1 Mask Register bit 4 mask. */
#define PORT_INT1MASK4_bp  4  /* Interrupt 1 Mask Register bit 4 position. */
#define PORT_INT1MASK5_bm  (1<<5)  /* Interrupt 1 Mask Register bit 5 mask. */
#define PORT_INT1MASK5_bp  5  /* Interrupt 1 Mask Register bit 5 position. */
#define PORT_INT1MASK6_bm  (1<<6)  /* Interrupt 1 Mask Register bit 6 mask. */
#define PORT_INT1MASK6_bp  6  /* Interrupt 1 Mask Register bit 6 position. */
#define PORT_INT1MASK7_bm  (1<<7)  /* Interrupt 1 Mask Register bit 7 mask. */
#define PORT_INT1MASK7_bp  7  /* Interrupt 1 Mask Register bit 7 position. */

/* PORT.INTFLAGS  bit masks and bit positions */
#define PORT_INT0IF_bm  0x01  /* Port Interrupt 0 Flag bit mask. */
#define PORT_INT0IF_bp  0  /* Port Interrupt 0 Flag bit position. */
#define PORT_INT1IF_bm  0x02  /* Port Interrupt 1 Flag bit mask. */
#define PORT_INT1IF_bp  1  /* Port Interrupt 1 Flag bit position. */

/* PORT.PIN0CTRL  bit masks and bit positions */
#define PORT_ISC_gm  0x07  /* Input/Sense Configuration group mask. */
#define PORT_ISC_gp  0  /* Input/Sense Configuration group position. */
#define PORT_ISC0_bm  (1<<0)  /* Input/Sense Configuration bit 0 mask. */
#define PORT_ISC0_bp  0  /* Input/Sense Configuration bit 0 position. */
#define PORT_ISC1_bm  (1<<1)  /* Input/Sense Configuration bit 1 mask. */
#define PORT_ISC1_bp  1  /* Input/Sense Configuration bit 1 position. */
#define PORT_ISC2_bm  (1<<2)  /* Input/Sense Configuration bit 2 mask. */
#define PORT_ISC2_bp  2  /* Input/Sense Configuration bit 2 position. */
#define PORT_OPC_gm  0x38  /* Output/Pull Configuration group mask. */
#define PORT_OPC_gp  3  /* Output/Pull Configuration group position. */
#define PORT_OPC0_bm  (1<<3)  /* Output/Pull Configuration bit 0 mask. */
#define PORT_OPC0_bp  3  /* Output/Pull Configuration bit 0 position. */
#define PORT_OPC1_bm  (1<<4)  /* Output/Pull Configuration bit 1 mask. */
#define PORT_OPC1_bp  4  /* Output/Pull Configuration bit 1 position. */
#define PORT_OPC2_bm  (1<<5)  /* Output/Pull Configuration bit 2 mask. */
#define PORT_OPC2_bp  5  /* Output/Pull Configuration bit 2 position. */
#define PORT_INVEN_bm  0x40  /* Inverted I/O Enable bit mask. */
#define PORT_INVEN_bp  6  /* Inverted I/O Enable bit position. */
#define PORT_SRLEN_bm  0x80  /* Slew Rate Enable bit mask. */
#define PORT_SRLEN_bp  7  /* Slew Rate Enable bit position. */

