gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* NVM_PROD_SIGNATURES.WAFNUM  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_WAFNUM_gm  0xFF  /* Wafer Number group mask. */
#define NVM_PROD_SIGNATURES_WAFNUM_gp  0  /* Wafer Number group position. */
#define NVM_PROD_SIGNATURES_WAFNUM0_bm  (1<<0)  /* Wafer Number bit 0 mask. */
#define NVM_PROD_SIGNATURES_WAFNUM0_bp  0  /* Wafer Number bit 0 position. */
#define NVM_PROD_SIGNATURES_WAFNUM1_bm  (1<<1)  /* Wafer Number bit 1 mask. */
#define NVM_PROD_SIGNATURES_WAFNUM1_bp  1  /* Wafer Number bit 1 position. */
#define NVM_PROD_SIGNATURES_WAFNUM2_bm  (1<<2)  /* Wafer Number bit 2 mask. */
#define NVM_PROD_SIGNATURES_WAFNUM2_bp  2  /* Wafer Number bit 2 position. */
#define NVM_PROD_SIGNATURES_WAFNUM3_bm  (1<<3)  /* Wafer Number bit 3 mask. */
#define NVM_PROD_SIGNATURES_WAFNUM3_bp  3  /* Wafer Number bit 3 position. */
#define NVM_PROD_SIGNATURES_WAFNUM4_bm  (1<<4)  /* Wafer Number bit 4 mask. */
#define NVM_PROD_SIGNATURES_WAFNUM4_bp  4  /* Wafer Number bit 4 position. */
#define NVM_PROD_SIGNATURES_WAFNUM5_bm  (1<<5)  /* Wafer Number bit 5 mask. */
#define NVM_PROD_SIGNATURES_WAFNUM5_bp  5  /* Wafer Number bit 5 position. */
#define NVM_PROD_SIGNATURES_WAFNUM6_bm  (1<<6)  /* Wafer Number bit 6 mask. */
#define NVM_PROD_SIGNATURES_WAFNUM6_bp  6  /* Wafer Number bit 6 position. */
#define NVM_PROD_SIGNATURES_WAFNUM7_bm  (1<<7)  /* Wafer Number bit 7 mask. */
#define NVM_PROD_SIGNATURES_WAFNUM7_bp  7  /* Wafer Number bit 7 position. */

/* NVM_PROD_SIGNATURES.COORDX0  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_COORDX0_gm  0xFF  /* Wafer Coordinate X Byte 0 group mask. */
#define NVM_PROD_SIGNATURES_COORDX0_gp  0  /* Wafer Coordinate X Byte 0 group position. */
#define NVM_PROD_SIGNATURES_COORDX00_bm  (1<<0)  /* Wafer Coordinate X Byte 0 bit 0 mask. */
#define NVM_PROD_SIGNATURES_COORDX00_bp  0  /* Wafer Coordinate X Byte 0 bit 0 position. */
#define NVM_PROD_SIGNATURES_COORDX01_bm  (1<<1)  /* Wafer Coordinate X Byte 0 bit 1 mask. */
#define NVM_PROD_SIGNATURES_COORDX01_bp  1  /* Wafer Coordinate X Byte 0 bit 1 position. */
#define NVM_PROD_SIGNATURES_COORDX02_bm  (1<<2)  /* Wafer Coordinate X Byte 0 bit 2 mask. */
#define NVM_PROD_SIGNATURES_COORDX02_bp  2  /* Wafer Coordinate X Byte 0 bit 2 position. */
#define NVM_PROD_SIGNATURES_COORDX03_bm  (1<<3)  /* Wafer Coordinate X Byte 0 bit 3 mask. */
#define NVM_PROD_SIGNATURES_COORDX03_bp  3  /* Wafer Coordinate X Byte 0 bit 3 position. */
#define NVM_PROD_SIGNATURES_COORDX04_bm  (1<<4)  /* Wafer Coordinate X Byte 0 bit 4 mask. */
#define NVM_PROD_SIGNATURES_COORDX04_bp  4  /* Wafer Coordinate X Byte 0 bit 4 position. */
#define NVM_PROD_SIGNATURES_COORDX05_bm  (1<<5)  /* Wafer Coordinate X Byte 0 bit 5 mask. */
#define NVM_PROD_SIGNATURES_COORDX05_bp  5  /* Wafer Coordinate X Byte 0 bit 5 position. */
#define NVM_PROD_SIGNATURES_COORDX06_bm  (1<<6)  /* Wafer Coordinate X Byte 0 bit 6 mask. */
#define NVM_PROD_SIGNATURES_COORDX06_bp  6  /* Wafer Coordinate X Byte 0 bit 6 position. */
#define NVM_PROD_SIGNATURES_COORDX07_bm  (1<<7)  /* Wafer Coordinate X Byte 0 bit 7 mask. */
#define NVM_PROD_SIGNATURES_COORDX07_bp  7  /* Wafer Coordinate X Byte 0 bit 7 position. */

/* NVM_PROD_SIGNATURES.COORDX1  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_COORDX1_gm  0xFF  /* Wafer Coordinate X Byte 1 group mask. */
#define NVM_PROD_SIGNATURES_COORDX1_gp  0  /* Wafer Coordinate X Byte 1 group position. */
#define NVM_PROD_SIGNATURES_COORDX10_bm  (1<<0)  /* Wafer Coordinate X Byte 1 bit 0 mask. */
#define NVM_PROD_SIGNATURES_COORDX10_bp  0  /* Wafer Coordinate X Byte 1 bit 0 position. */
#define NVM_PROD_SIGNATURES_COORDX11_bm  (1<<1)  /* Wafer Coordinate X Byte 1 bit 1 mask. */
#define NVM_PROD_SIGNATURES_COORDX11_bp  1  /* Wafer Coordinate X Byte 1 bit 1 position. */
#define NVM_PROD_SIGNATURES_COORDX12_bm  (1<<2)  /* Wafer Coordinate X Byte 1 bit 2 mask. */
#define NVM_PROD_SIGNATURES_COORDX12_bp  2  /* Wafer Coordinate X Byte 1 bit 2 position. */
#define NVM_PROD_SIGNATURES_COORDX13_bm  (1<<3)  /* Wafer Coordinate X Byte 1 bit 3 mask. */
#define NVM_PROD_SIGNATURES_COORDX13_bp  3  /* Wafer Coordinate X Byte 1 bit 3 position. */
#define NVM_PROD_SIGNATURES_COORDX14_bm  (1<<4)  /* Wafer Coordinate X Byte 1 bit 4 mask. */
#define NVM_PROD_SIGNATURES_COORDX14_bp  4  /* Wafer Coordinate X Byte 1 bit 4 position. */
#define NVM_PROD_SIGNATURES_COORDX15_bm  (1<<5)  /* Wafer Coordinate X Byte 1 bit 5 mask. */
#define NVM_PROD_SIGNATURES_COORDX15_bp  5  /* Wafer Coordinate X Byte 1 bit 5 position. */
#define NVM_PROD_SIGNATURES_COORDX16_bm  (1<<6)  /* Wafer Coordinate X Byte 1 bit 6 mask. */
#define NVM_PROD_SIGNATURES_COORDX16_bp  6  /* Wafer Coordinate X Byte 1 bit 6 position. */
#define NVM_PROD_SIGNATURES_COORDX17_bm  (1<<7)  /* Wafer Coordinate X Byte 1 bit 7 mask. */
#define NVM_PROD_SIGNATURES_COORDX17_bp  7  /* Wafer Coordinate X Byte 1 bit 7 position. */

/* NVM_PROD_SIGNATURES.COORDY0  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_COORDY0_gm  0xFF  /* Wafer Coordinate Y Byte 0 group mask. */
#define NVM_PROD_SIGNATURES_COORDY0_gp  0  /* Wafer Coordinate Y Byte 0 group position. */
#define NVM_PROD_SIGNATURES_COORDY00_bm  (1<<0)  /* Wafer Coordinate Y Byte 0 bit 0 mask. */
#define NVM_PROD_SIGNATURES_COORDY00_bp  0  /* Wafer Coordinate Y Byte 0 bit 0 position. */
#define NVM_PROD_SIGNATURES_COORDY01_bm  (1<<1)  /* Wafer Coordinate Y Byte 0 bit 1 mask. */
#define NVM_PROD_SIGNATURES_COORDY01_bp  1  /* Wafer Coordinate Y Byte 0 bit 1 position. */
#define NVM_PROD_SIGNATURES_COORDY02_bm  (1<<2)  /* Wafer Coordinate Y Byte 0 bit 2 mask. */
#define NVM_PROD_SIGNATURES_COORDY02_bp  2  /* Wafer Coordinate Y Byte 0 bit 2 position. */
#define NVM_PROD_SIGNATURES_COORDY03_bm  (1<<3)  /* Wafer Coordinate Y Byte 0 bit 3 mask. */
#define NVM_PROD_SIGNATURES_COORDY03_bp  3  /* Wafer Coordinate Y Byte 0 bit 3 position. */
#define NVM_PROD_SIGNATURES_COORDY04_bm  (1<<4)  /* Wafer Coordinate Y Byte 0 bit 4 mask. */
#define NVM_PROD_SIGNATURES_COORDY04_bp  4  /* Wafer Coordinate Y Byte 0 bit 4 position. */
#define NVM_PROD_SIGNATURES_COORDY05_bm  (1<<5)  /* Wafer Coordinate Y Byte 0 bit 5 mask. */
#define NVM_PROD_SIGNATURES_COORDY05_bp  5  /* Wafer Coordinate Y Byte 0 bit 5 position. */
#define NVM_PROD_SIGNATURES_COORDY06_bm  (1<<6)  /* Wafer Coordinate Y Byte 0 bit 6 mask. */
#define NVM_PROD_SIGNATURES_COORDY06_bp  6  /* Wafer Coordinate Y Byte 0 bit 6 position. */
#define NVM_PROD_SIGNATURES_COORDY07_bm  (1<<7)  /* Wafer Coordinate Y Byte 0 bit 7 mask. */
#define NVM_PROD_SIGNATURES_COORDY07_bp  7  /* Wafer Coordinate Y Byte 0 bit 7 position. */

/* NVM_PROD_SIGNATURES.COORDY1  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_COORDY1_gm  0xFF  /* Wafer Coordinate Y Byte 1 group mask. */
#define NVM_PROD_SIGNATURES_COORDY1_gp  0  /* Wafer Coordinate Y Byte 1 group position. */
#define NVM_PROD_SIGNATURES_COORDY10_bm  (1<<0)  /* Wafer Coordinate Y Byte 1 bit 0 mask. */
#define NVM_PROD_SIGNATURES_COORDY10_bp  0  /* Wafer Coordinate Y Byte 1 bit 0 position. */
#define NVM_PROD_SIGNATURES_COORDY11_bm  (1<<1)  /* Wafer Coordinate Y Byte 1 bit 1 mask. */
#define NVM_PROD_SIGNATURES_COORDY11_bp  1  /* Wafer Coordinate Y Byte 1 bit 1 position. */
#define NVM_PROD_SIGNATURES_COORDY12_bm  (1<<2)  /* Wafer Coordinate Y Byte 1 bit 2 mask. */
#define NVM_PROD_SIGNATURES_COORDY12_bp  2  /* Wafer Coordinate Y Byte 1 bit 2 position. */
#define NVM_PROD_SIGNATURES_COORDY13_bm  (1<<3)  /* Wafer Coordinate Y Byte 1 bit 3 mask. */
#define NVM_PROD_SIGNATURES_COORDY13_bp  3  /* Wafer Coordinate Y Byte 1 bit 3 position. */
#define NVM_PROD_SIGNATURES_COORDY14_bm  (1<<4)  /* Wafer Coordinate Y Byte 1 bit 4 mask. */
#define NVM_PROD_SIGNATURES_COORDY14_bp  4  /* Wafer Coordinate Y Byte 1 bit 4 position. */
#define NVM_PROD_SIGNATURES_COORDY15_bm  (1<<5)  /* Wafer Coordinate Y Byte 1 bit 5 mask. */
#define NVM_PROD_SIGNATURES_COORDY15_bp  5  /* Wafer Coordinate Y Byte 1 bit 5 position. */
#define NVM_PROD_SIGNATURES_COORDY16_bm  (1<<6)  /* Wafer Coordinate Y Byte 1 bit 6 mask. */
#define NVM_PROD_SIGNATURES_COORDY16_bp  6  /* Wafer Coordinate Y Byte 1 bit 6 position. */
#define NVM_PROD_SIGNATURES_COORDY17_bm  (1<<7)  /* Wafer Coordinate Y Byte 1 bit 7 mask. */
#define NVM_PROD_SIGNATURES_COORDY17_bp  7  /* Wafer Coordinate Y Byte 1 bit 7 position. */

/* NVM_PROD_SIGNATURES.ADCCAL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_ADCCAL_gm  0xFF  /* ADC Calibration Byte group mask. */
#define NVM_PROD_SIGNATURES_ADCCAL_gp  0  /* ADC Calibration Byte group position. */
#define NVM_PROD_SIGNATURES_ADCCAL0_bm  (1<<0)  /* ADC Calibration Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_ADCCAL0_bp  0  /* ADC Calibration Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_ADCCAL1_bm  (1<<1)  /* ADC Calibration Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_ADCCAL1_bp  1  /* ADC Calibration Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_ADCCAL2_bm  (1<<2)  /* ADC Calibration Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_ADCCAL2_bp  2  /* ADC Calibration Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_ADCCAL3_bm  (1<<3)  /* ADC Calibration Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_ADCCAL3_bp  3  /* ADC Calibration Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_ADCCAL4_bm  (1<<4)  /* ADC Calibration Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_ADCCAL4_bp  4  /* ADC Calibration Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_ADCCAL5_bm  (1<<5)  /* ADC Calibration Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_ADCCAL5_bp  5  /* ADC Calibration Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_ADCCAL6_bm  (1<<6)  /* ADC Calibration Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_ADCCAL6_bp  6  /* ADC Calibration Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_ADCCAL7_bm  (1<<7)  /* ADC Calibration Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_ADCCAL7_bp  7  /* ADC Calibration Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.TEMPSENSE25CL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL_gm  0xFF  /* Internal Temperature Sensor Low Byte group mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL_gp  0  /* Internal Temperature Sensor Low Byte group position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL0_bm  (1<<0)  /* Internal Temperature Sensor Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL0_bp  0  /* Internal Temperature Sensor Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL1_bm  (1<<1)  /* Internal Temperature Sensor Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL1_bp  1  /* Internal Temperature Sensor Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL2_bm  (1<<2)  /* Internal Temperature Sensor Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL2_bp  2  /* Internal Temperature Sensor Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL3_bm  (1<<3)  /* Internal Temperature Sensor Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL3_bp  3  /* Internal Temperature Sensor Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL4_bm  (1<<4)  /* Internal Temperature Sensor Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL4_bp  4  /* Internal Temperature Sensor Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL5_bm  (1<<5)  /* Internal Temperature Sensor Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL5_bp  5  /* Internal Temperature Sensor Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL6_bm  (1<<6)  /* Internal Temperature Sensor Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL6_bp  6  /* Internal Temperature Sensor Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL7_bm  (1<<7)  /* Internal Temperature Sensor Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CL7_bp  7  /* Internal Temperature Sensor Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.TEMPSENSE25CH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CH_gm  0x0F  /* Internal Temperature Sensor High Byte group mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CH_gp  0  /* Internal Temperature Sensor High Byte group position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CH0_bm  (1<<0)  /* Internal Temperature Sensor High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CH0_bp  0  /* Internal Temperature Sensor High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CH1_bm  (1<<1)  /* Internal Temperature Sensor High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CH1_bp  1  /* Internal Temperature Sensor High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CH2_bm  (1<<2)  /* Internal Temperature Sensor High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CH2_bp  2  /* Internal Temperature Sensor High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CH3_bm  (1<<3)  /* Internal Temperature Sensor High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE25CH3_bp  3  /* Internal Temperature Sensor High Byte bit 3 position. */

/* NVM_PROD_SIGNATURES.TEMPSENSE85CL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL_gm  0xFF  /* Internal Temperature Sensor Low Byte group mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL_gp  0  /* Internal Temperature Sensor Low Byte group position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL0_bm  (1<<0)  /* Internal Temperature Sensor Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL0_bp  0  /* Internal Temperature Sensor Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL1_bm  (1<<1)  /* Internal Temperature Sensor Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL1_bp  1  /* Internal Temperature Sensor Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL2_bm  (1<<2)  /* Internal Temperature Sensor Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL2_bp  2  /* Internal Temperature Sensor Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL3_bm  (1<<3)  /* Internal Temperature Sensor Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL3_bp  3  /* Internal Temperature Sensor Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL4_bm  (1<<4)  /* Internal Temperature Sensor Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL4_bp  4  /* Internal Temperature Sensor Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL5_bm  (1<<5)  /* Internal Temperature Sensor Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL5_bp  5  /* Internal Temperature Sensor Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL6_bm  (1<<6)  /* Internal Temperature Sensor Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL6_bp  6  /* Internal Temperature Sensor Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL7_bm  (1<<7)  /* Internal Temperature Sensor Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CL7_bp  7  /* Internal Temperature Sensor Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.TEMPSENSE85CH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CH_gm  0x0F  /* Internal Temperature Sensor High Byte group mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CH_gp  0  /* Internal Temperature Sensor High Byte group position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CH0_bm  (1<<0)  /* Internal Temperature Sensor High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CH0_bp  0  /* Internal Temperature Sensor High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CH1_bm  (1<<1)  /* Internal Temperature Sensor High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CH1_bp  1  /* Internal Temperature Sensor High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CH2_bm  (1<<2)  /* Internal Temperature Sensor High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CH2_bp  2  /* Internal Temperature Sensor High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CH3_bm  (1<<3)  /* Internal Temperature Sensor High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_TEMPSENSE85CH3_bp  3  /* Internal Temperature Sensor High Byte bit 3 position. */

