gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* NVM_PROD_SIGNATURES.BATTOFFSET  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_BATTOFFSET_gm  0xFF  /* BATT Offset group mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET_gp  0  /* BATT Offset group position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET0_bm  (1<<0)  /* BATT Offset bit 0 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET0_bp  0  /* BATT Offset bit 0 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET1_bm  (1<<1)  /* BATT Offset bit 1 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET1_bp  1  /* BATT Offset bit 1 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET2_bm  (1<<2)  /* BATT Offset bit 2 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET2_bp  2  /* BATT Offset bit 2 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET3_bm  (1<<3)  /* BATT Offset bit 3 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET3_bp  3  /* BATT Offset bit 3 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET4_bm  (1<<4)  /* BATT Offset bit 4 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET4_bp  4  /* BATT Offset bit 4 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET5_bm  (1<<5)  /* BATT Offset bit 5 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET5_bp  5  /* BATT Offset bit 5 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET6_bm  (1<<6)  /* BATT Offset bit 6 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET6_bp  6  /* BATT Offset bit 6 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET7_bm  (1<<7)  /* BATT Offset bit 7 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET7_bp  7  /* BATT Offset bit 7 position. */

/* NVM_PROD_SIGNATURES.BATTGAINL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_BATTGAINL_gm  0xFF  /* BATT Gain Low Byte group mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL_gp  0  /* BATT Gain Low Byte group position. */
#define NVM_PROD_SIGNATURES_BATTGAINL0_bm  (1<<0)  /* BATT Gain Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL0_bp  0  /* BATT Gain Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL1_bm  (1<<1)  /* BATT Gain Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL1_bp  1  /* BATT Gain Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL2_bm  (1<<2)  /* BATT Gain Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL2_bp  2  /* BATT Gain Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL3_bm  (1<<3)  /* BATT Gain Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL3_bp  3  /* BATT Gain Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL4_bm  (1<<4)  /* BATT Gain Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL4_bp  4  /* BATT Gain Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL5_bm  (1<<5)  /* BATT Gain Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL5_bp  5  /* BATT Gain Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL6_bm  (1<<6)  /* BATT Gain Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL6_bp  6  /* BATT Gain Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL7_bm  (1<<7)  /* BATT Gain Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL7_bp  7  /* BATT Gain Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.BATTGAINH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_BATTGAINH_gm  0xFF  /* BATT Gain High Byte group mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH_gp  0  /* BATT Gain High Byte group position. */
#define NVM_PROD_SIGNATURES_BATTGAINH0_bm  (1<<0)  /* BATT Gain High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH0_bp  0  /* BATT Gain High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH1_bm  (1<<1)  /* BATT Gain High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH1_bp  1  /* BATT Gain High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH2_bm  (1<<2)  /* BATT Gain High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH2_bp  2  /* BATT Gain High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH3_bm  (1<<3)  /* BATT Gain High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH3_bp  3  /* BATT Gain High Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH4_bm  (1<<4)  /* BATT Gain High Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH4_bp  4  /* BATT Gain High Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH5_bm  (1<<5)  /* BATT Gain High Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH5_bp  5  /* BATT Gain High Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH6_bm  (1<<6)  /* BATT Gain High Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH6_bp  6  /* BATT Gain High Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH7_bm  (1<<7)  /* BATT Gain High Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH7_bp  7  /* BATT Gain High Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.TESTTEMPROOM  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM_gm  0x7F  /* Test Temperature Room group mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM_gp  0  /* Test Temperature Room group position. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM0_bm  (1<<0)  /* Test Temperature Room bit 0 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM0_bp  0  /* Test Temperature Room bit 0 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM1_bm  (1<<1)  /* Test Temperature Room bit 1 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM1_bp  1  /* Test Temperature Room bit 1 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM2_bm  (1<<2)  /* Test Temperature Room bit 2 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM2_bp  2  /* Test Temperature Room bit 2 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM3_bm  (1<<3)  /* Test Temperature Room bit 3 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM3_bp  3  /* Test Temperature Room bit 3 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM4_bm  (1<<4)  /* Test Temperature Room bit 4 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM4_bp  4  /* Test Temperature Room bit 4 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM5_bm  (1<<5)  /* Test Temperature Room bit 5 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM5_bp  5  /* Test Temperature Room bit 5 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM6_bm  (1<<6)  /* Test Temperature Room bit 6 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPROOM6_bp  6  /* Test Temperature Room bit 6 position. */

