gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* NVM_PROD_SIGNATURES.TESTTEMPHOTDIFF  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF_gm  0x7F  /* Test Temperature Hot Diff group mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF_gp  0  /* Test Temperature Hot Diff group position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF0_bm  (1<<0)  /* Test Temperature Hot Diff bit 0 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF0_bp  0  /* Test Temperature Hot Diff bit 0 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF1_bm  (1<<1)  /* Test Temperature Hot Diff bit 1 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF1_bp  1  /* Test Temperature Hot Diff bit 1 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF2_bm  (1<<2)  /* Test Temperature Hot Diff bit 2 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF2_bp  2  /* Test Temperature Hot Diff bit 2 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF3_bm  (1<<3)  /* Test Temperature Hot Diff bit 3 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF3_bp  3  /* Test Temperature Hot Diff bit 3 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF4_bm  (1<<4)  /* Test Temperature Hot Diff bit 4 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF4_bp  4  /* Test Temperature Hot Diff bit 4 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF5_bm  (1<<5)  /* Test Temperature Hot Diff bit 5 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF5_bp  5  /* Test Temperature Hot Diff bit 5 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF6_bm  (1<<6)  /* Test Temperature Hot Diff bit 6 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF6_bp  6  /* Test Temperature Hot Diff bit 6 position. */

/* NVM_PROD_SIGNATURES.RXAMPOFFSETLP  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP_gm  0x3F  /* RX Amplifier Offset Byte Low Pass group mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP_gp  0  /* RX Amplifier Offset Byte Low Pass group position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP0_bm  (1<<0)  /* RX Amplifier Offset Byte Low Pass bit 0 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP0_bp  0  /* RX Amplifier Offset Byte Low Pass bit 0 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP1_bm  (1<<1)  /* RX Amplifier Offset Byte Low Pass bit 1 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP1_bp  1  /* RX Amplifier Offset Byte Low Pass bit 1 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP2_bm  (1<<2)  /* RX Amplifier Offset Byte Low Pass bit 2 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP2_bp  2  /* RX Amplifier Offset Byte Low Pass bit 2 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP3_bm  (1<<3)  /* RX Amplifier Offset Byte Low Pass bit 3 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP3_bp  3  /* RX Amplifier Offset Byte Low Pass bit 3 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP4_bm  (1<<4)  /* RX Amplifier Offset Byte Low Pass bit 4 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP4_bp  4  /* RX Amplifier Offset Byte Low Pass bit 4 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP5_bm  (1<<5)  /* RX Amplifier Offset Byte Low Pass bit 5 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETLP5_bp  5  /* RX Amplifier Offset Byte Low Pass bit 5 position. */

/* NVM_PROD_SIGNATURES.RXAMPOFFSETBP  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP_gm  0x3F  /* RX Amplifier Offset Byte Band Pass group mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP_gp  0  /* RX Amplifier Offset Byte Band Pass group position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP0_bm  (1<<0)  /* RX Amplifier Offset Byte Band Pass bit 0 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP0_bp  0  /* RX Amplifier Offset Byte Band Pass bit 0 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP1_bm  (1<<1)  /* RX Amplifier Offset Byte Band Pass bit 1 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP1_bp  1  /* RX Amplifier Offset Byte Band Pass bit 1 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP2_bm  (1<<2)  /* RX Amplifier Offset Byte Band Pass bit 2 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP2_bp  2  /* RX Amplifier Offset Byte Band Pass bit 2 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP3_bm  (1<<3)  /* RX Amplifier Offset Byte Band Pass bit 3 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP3_bp  3  /* RX Amplifier Offset Byte Band Pass bit 3 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP4_bm  (1<<4)  /* RX Amplifier Offset Byte Band Pass bit 4 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP4_bp  4  /* RX Amplifier Offset Byte Band Pass bit 4 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP5_bm  (1<<5)  /* RX Amplifier Offset Byte Band Pass bit 5 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSETBP5_bp  5  /* RX Amplifier Offset Byte Band Pass bit 5 position. */

/* NVM_PROD_SIGNATURES.TX24VLEVEL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_LEVEL_gm  0x1F  /* TX 24V Level Setting group mask. */
#define NVM_PROD_SIGNATURES_LEVEL_gp  0  /* TX 24V Level Setting group position. */
#define NVM_PROD_SIGNATURES_LEVEL0_bm  (1<<0)  /* TX 24V Level Setting bit 0 mask. */
#define NVM_PROD_SIGNATURES_LEVEL0_bp  0  /* TX 24V Level Setting bit 0 position. */
#define NVM_PROD_SIGNATURES_LEVEL1_bm  (1<<1)  /* TX 24V Level Setting bit 1 mask. */
#define NVM_PROD_SIGNATURES_LEVEL1_bp  1  /* TX 24V Level Setting bit 1 position. */
#define NVM_PROD_SIGNATURES_LEVEL2_bm  (1<<2)  /* TX 24V Level Setting bit 2 mask. */
#define NVM_PROD_SIGNATURES_LEVEL2_bp  2  /* TX 24V Level Setting bit 2 position. */
#define NVM_PROD_SIGNATURES_LEVEL3_bm  (1<<3)  /* TX 24V Level Setting bit 3 mask. */
#define NVM_PROD_SIGNATURES_LEVEL3_bp  3  /* TX 24V Level Setting bit 3 position. */
#define NVM_PROD_SIGNATURES_LEVEL4_bm  (1<<4)  /* TX 24V Level Setting bit 4 mask. */
#define NVM_PROD_SIGNATURES_LEVEL4_bp  4  /* TX 24V Level Setting bit 4 position. */

/* NVM_PROD_SIGNATURES.RCCAL24MHZL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL_gm  0xFF  /* 24MHz RC Oscillator Calibration Low Byte group mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL_gp  0  /* 24MHz RC Oscillator Calibration Low Byte group position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL0_bm  (1<<0)  /* 24MHz RC Oscillator Calibration Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL0_bp  0  /* 24MHz RC Oscillator Calibration Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL1_bm  (1<<1)  /* 24MHz RC Oscillator Calibration Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL1_bp  1  /* 24MHz RC Oscillator Calibration Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL2_bm  (1<<2)  /* 24MHz RC Oscillator Calibration Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL2_bp  2  /* 24MHz RC Oscillator Calibration Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL3_bm  (1<<3)  /* 24MHz RC Oscillator Calibration Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL3_bp  3  /* 24MHz RC Oscillator Calibration Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL4_bm  (1<<4)  /* 24MHz RC Oscillator Calibration Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL4_bp  4  /* 24MHz RC Oscillator Calibration Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL5_bm  (1<<5)  /* 24MHz RC Oscillator Calibration Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL5_bp  5  /* 24MHz RC Oscillator Calibration Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL6_bm  (1<<6)  /* 24MHz RC Oscillator Calibration Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL6_bp  6  /* 24MHz RC Oscillator Calibration Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL7_bm  (1<<7)  /* 24MHz RC Oscillator Calibration Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL7_bp  7  /* 24MHz RC Oscillator Calibration Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.RCCAL24MHZH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH_gm  0x1F  /* 24MHz RC Oscillator Calibration High Byte group mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH_gp  0  /* 24MHz RC Oscillator Calibration High Byte group position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH0_bm  (1<<0)  /* 24MHz RC Oscillator Calibration High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH0_bp  0  /* 24MHz RC Oscillator Calibration High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH1_bm  (1<<1)  /* 24MHz RC Oscillator Calibration High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH1_bp  1  /* 24MHz RC Oscillator Calibration High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH2_bm  (1<<2)  /* 24MHz RC Oscillator Calibration High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH2_bp  2  /* 24MHz RC Oscillator Calibration High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH3_bm  (1<<3)  /* 24MHz RC Oscillator Calibration High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH3_bp  3  /* 24MHz RC Oscillator Calibration High Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH4_bm  (1<<4)  /* 24MHz RC Oscillator Calibration High Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH4_bp  4  /* 24MHz RC Oscillator Calibration High Byte bit 4 position. */

/* NVM_PROD_SIGNATURES.ULPRCCALL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_ULPRCCALL_gm  0xFF  /* ULP RC Oscillator Calibration Low Byte group mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL_gp  0  /* ULP RC Oscillator Calibration Low Byte group position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL0_bm  (1<<0)  /* ULP RC Oscillator Calibration Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL0_bp  0  /* ULP RC Oscillator Calibration Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL1_bm  (1<<1)  /* ULP RC Oscillator Calibration Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL1_bp  1  /* ULP RC Oscillator Calibration Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL2_bm  (1<<2)  /* ULP RC Oscillator Calibration Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL2_bp  2  /* ULP RC Oscillator Calibration Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL3_bm  (1<<3)  /* ULP RC Oscillator Calibration Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL3_bp  3  /* ULP RC Oscillator Calibration Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL4_bm  (1<<4)  /* ULP RC Oscillator Calibration Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL4_bp  4  /* ULP RC Oscillator Calibration Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL5_bm  (1<<5)  /* ULP RC Oscillator Calibration Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL5_bp  5  /* ULP RC Oscillator Calibration Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL6_bm  (1<<6)  /* ULP RC Oscillator Calibration Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL6_bp  6  /* ULP RC Oscillator Calibration Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL7_bm  (1<<7)  /* ULP RC Oscillator Calibration Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL7_bp  7  /* ULP RC Oscillator Calibration Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.ULPRCCALH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_ULPRCCALH_gm  0x1F  /* ULP RC Oscillator Calibration High Byte group mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH_gp  0  /* ULP RC Oscillator Calibration High Byte group position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH0_bm  (1<<0)  /* ULP RC Oscillator Calibration High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH0_bp  0  /* ULP RC Oscillator Calibration High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH1_bm  (1<<1)  /* ULP RC Oscillator Calibration High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH1_bp  1  /* ULP RC Oscillator Calibration High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH2_bm  (1<<2)  /* ULP RC Oscillator Calibration High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH2_bp  2  /* ULP RC Oscillator Calibration High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH3_bm  (1<<3)  /* ULP RC Oscillator Calibration High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH3_bp  3  /* ULP RC Oscillator Calibration High Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH4_bm  (1<<4)  /* ULP RC Oscillator Calibration High Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH4_bp  4  /* ULP RC Oscillator Calibration High Byte bit 4 position. */

/* NVM_PROD_SIGNATURES.BGCAL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_BGCAL_gm  0x7F  /* Band Gap Calibration Byte group mask. */
#define NVM_PROD_SIGNATURES_BGCAL_gp  0  /* Band Gap Calibration Byte group position. */
#define NVM_PROD_SIGNATURES_BGCAL0_bm  (1<<0)  /* Band Gap Calibration Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_BGCAL0_bp  0  /* Band Gap Calibration Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_BGCAL1_bm  (1<<1)  /* Band Gap Calibration Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_BGCAL1_bp  1  /* Band Gap Calibration Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_BGCAL2_bm  (1<<2)  /* Band Gap Calibration Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_BGCAL2_bp  2  /* Band Gap Calibration Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_BGCAL3_bm  (1<<3)  /* Band Gap Calibration Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_BGCAL3_bp  3  /* Band Gap Calibration Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_BGCAL4_bm  (1<<4)  /* Band Gap Calibration Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_BGCAL4_bp  4  /* Band Gap Calibration Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_BGCAL5_bm  (1<<5)  /* Band Gap Calibration Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_BGCAL5_bp  5  /* Band Gap Calibration Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_BGCAL6_bm  (1<<6)  /* Band Gap Calibration Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_BGCAL6_bp  6  /* Band Gap Calibration Byte bit 6 position. */

