gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* NVM_PROD_SIGNATURES.LDOCAL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_LDOCAL_gm  0x07  /* LDO Calibration group mask. */
#define NVM_PROD_SIGNATURES_LDOCAL_gp  0  /* LDO Calibration group position. */
#define NVM_PROD_SIGNATURES_LDOCAL0_bm  (1<<0)  /* LDO Calibration bit 0 mask. */
#define NVM_PROD_SIGNATURES_LDOCAL0_bp  0  /* LDO Calibration bit 0 position. */
#define NVM_PROD_SIGNATURES_LDOCAL1_bm  (1<<1)  /* LDO Calibration bit 1 mask. */
#define NVM_PROD_SIGNATURES_LDOCAL1_bp  1  /* LDO Calibration bit 1 position. */
#define NVM_PROD_SIGNATURES_LDOCAL2_bm  (1<<2)  /* LDO Calibration bit 2 mask. */
#define NVM_PROD_SIGNATURES_LDOCAL2_bp  2  /* LDO Calibration bit 2 position. */

/* NVM_PROD_SIGNATURES.NVMPROG  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_NVMPROG_gm  0xFF  /* NVM Programming group mask. */
#define NVM_PROD_SIGNATURES_NVMPROG_gp  0  /* NVM Programming group position. */
#define NVM_PROD_SIGNATURES_NVMPROG0_bm  (1<<0)  /* NVM Programming bit 0 mask. */
#define NVM_PROD_SIGNATURES_NVMPROG0_bp  0  /* NVM Programming bit 0 position. */
#define NVM_PROD_SIGNATURES_NVMPROG1_bm  (1<<1)  /* NVM Programming bit 1 mask. */
#define NVM_PROD_SIGNATURES_NVMPROG1_bp  1  /* NVM Programming bit 1 position. */
#define NVM_PROD_SIGNATURES_NVMPROG2_bm  (1<<2)  /* NVM Programming bit 2 mask. */
#define NVM_PROD_SIGNATURES_NVMPROG2_bp  2  /* NVM Programming bit 2 position. */
#define NVM_PROD_SIGNATURES_NVMPROG3_bm  (1<<3)  /* NVM Programming bit 3 mask. */
#define NVM_PROD_SIGNATURES_NVMPROG3_bp  3  /* NVM Programming bit 3 position. */
#define NVM_PROD_SIGNATURES_NVMPROG4_bm  (1<<4)  /* NVM Programming bit 4 mask. */
#define NVM_PROD_SIGNATURES_NVMPROG4_bp  4  /* NVM Programming bit 4 position. */
#define NVM_PROD_SIGNATURES_NVMPROG5_bm  (1<<5)  /* NVM Programming bit 5 mask. */
#define NVM_PROD_SIGNATURES_NVMPROG5_bp  5  /* NVM Programming bit 5 position. */
#define NVM_PROD_SIGNATURES_NVMPROG6_bm  (1<<6)  /* NVM Programming bit 6 mask. */
#define NVM_PROD_SIGNATURES_NVMPROG6_bp  6  /* NVM Programming bit 6 position. */
#define NVM_PROD_SIGNATURES_NVMPROG7_bm  (1<<7)  /* NVM Programming bit 7 mask. */
#define NVM_PROD_SIGNATURES_NVMPROG7_bp  7  /* NVM Programming bit 7 position. */

/* NVM_PROD_SIGNATURES.NVMERASE  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_NVMERASE_gm  0xFF  /* NVM Erase group mask. */
#define NVM_PROD_SIGNATURES_NVMERASE_gp  0  /* NVM Erase group position. */
#define NVM_PROD_SIGNATURES_NVMERASE0_bm  (1<<0)  /* NVM Erase bit 0 mask. */
#define NVM_PROD_SIGNATURES_NVMERASE0_bp  0  /* NVM Erase bit 0 position. */
#define NVM_PROD_SIGNATURES_NVMERASE1_bm  (1<<1)  /* NVM Erase bit 1 mask. */
#define NVM_PROD_SIGNATURES_NVMERASE1_bp  1  /* NVM Erase bit 1 position. */
#define NVM_PROD_SIGNATURES_NVMERASE2_bm  (1<<2)  /* NVM Erase bit 2 mask. */
#define NVM_PROD_SIGNATURES_NVMERASE2_bp  2  /* NVM Erase bit 2 position. */
#define NVM_PROD_SIGNATURES_NVMERASE3_bm  (1<<3)  /* NVM Erase bit 3 mask. */
#define NVM_PROD_SIGNATURES_NVMERASE3_bp  3  /* NVM Erase bit 3 position. */
#define NVM_PROD_SIGNATURES_NVMERASE4_bm  (1<<4)  /* NVM Erase bit 4 mask. */
#define NVM_PROD_SIGNATURES_NVMERASE4_bp  4  /* NVM Erase bit 4 position. */
#define NVM_PROD_SIGNATURES_NVMERASE5_bm  (1<<5)  /* NVM Erase bit 5 mask. */
#define NVM_PROD_SIGNATURES_NVMERASE5_bp  5  /* NVM Erase bit 5 position. */
#define NVM_PROD_SIGNATURES_NVMERASE6_bm  (1<<6)  /* NVM Erase bit 6 mask. */
#define NVM_PROD_SIGNATURES_NVMERASE6_bp  6  /* NVM Erase bit 6 position. */
#define NVM_PROD_SIGNATURES_NVMERASE7_bm  (1<<7)  /* NVM Erase bit 7 mask. */
#define NVM_PROD_SIGNATURES_NVMERASE7_bp  7  /* NVM Erase bit 7 position. */

/* NVM_PROD_SIGNATURES.ADCBIAS  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_ADCBIAS_gm  0xFF  /* ADC Bias Selection group mask. */
#define NVM_PROD_SIGNATURES_ADCBIAS_gp  0  /* ADC Bias Selection group position. */
#define NVM_PROD_SIGNATURES_ADCBIAS0_bm  (1<<0)  /* ADC Bias Selection bit 0 mask. */
#define NVM_PROD_SIGNATURES_ADCBIAS0_bp  0  /* ADC Bias Selection bit 0 position. */
#define NVM_PROD_SIGNATURES_ADCBIAS1_bm  (1<<1)  /* ADC Bias Selection bit 1 mask. */
#define NVM_PROD_SIGNATURES_ADCBIAS1_bp  1  /* ADC Bias Selection bit 1 position. */
#define NVM_PROD_SIGNATURES_ADCBIAS2_bm  (1<<2)  /* ADC Bias Selection bit 2 mask. */
#define NVM_PROD_SIGNATURES_ADCBIAS2_bp  2  /* ADC Bias Selection bit 2 position. */
#define NVM_PROD_SIGNATURES_ADCBIAS3_bm  (1<<3)  /* ADC Bias Selection bit 3 mask. */
#define NVM_PROD_SIGNATURES_ADCBIAS3_bp  3  /* ADC Bias Selection bit 3 position. */
#define NVM_PROD_SIGNATURES_ADCBIAS4_bm  (1<<4)  /* ADC Bias Selection bit 4 mask. */
#define NVM_PROD_SIGNATURES_ADCBIAS4_bp  4  /* ADC Bias Selection bit 4 position. */
#define NVM_PROD_SIGNATURES_ADCBIAS5_bm  (1<<5)  /* ADC Bias Selection bit 5 mask. */
#define NVM_PROD_SIGNATURES_ADCBIAS5_bp  5  /* ADC Bias Selection bit 5 position. */
#define NVM_PROD_SIGNATURES_ADCBIAS6_bm  (1<<6)  /* ADC Bias Selection bit 6 mask. */
#define NVM_PROD_SIGNATURES_ADCBIAS6_bp  6  /* ADC Bias Selection bit 6 position. */
#define NVM_PROD_SIGNATURES_ADCBIAS7_bm  (1<<7)  /* ADC Bias Selection bit 7 mask. */
#define NVM_PROD_SIGNATURES_ADCBIAS7_bp  7  /* ADC Bias Selection bit 7 position. */

/* NVM_PROD_SIGNATURES.AUTOLOADEN  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_AUTOLOADEN_gm  0xFF  /* Autoload Enable group mask. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN_gp  0  /* Autoload Enable group position. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN0_bm  (1<<0)  /* Autoload Enable bit 0 mask. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN0_bp  0  /* Autoload Enable bit 0 position. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN1_bm  (1<<1)  /* Autoload Enable bit 1 mask. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN1_bp  1  /* Autoload Enable bit 1 position. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN2_bm  (1<<2)  /* Autoload Enable bit 2 mask. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN2_bp  2  /* Autoload Enable bit 2 position. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN3_bm  (1<<3)  /* Autoload Enable bit 3 mask. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN3_bp  3  /* Autoload Enable bit 3 position. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN4_bm  (1<<4)  /* Autoload Enable bit 4 mask. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN4_bp  4  /* Autoload Enable bit 4 position. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN5_bm  (1<<5)  /* Autoload Enable bit 5 mask. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN5_bp  5  /* Autoload Enable bit 5 position. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN6_bm  (1<<6)  /* Autoload Enable bit 6 mask. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN6_bp  6  /* Autoload Enable bit 6 position. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN7_bm  (1<<7)  /* Autoload Enable bit 7 mask. */
#define NVM_PROD_SIGNATURES_AUTOLOADEN7_bp  7  /* Autoload Enable bit 7 position. */

/* NVM_PROD_SIGNATURES.RC24MHZROOML  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RC24MHZROOML_gm  0xFF  /* 24 MHz Room Low Byte group mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML_gp  0  /* 24 MHz Room Low Byte group position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML0_bm  (1<<0)  /* 24 MHz Room Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML0_bp  0  /* 24 MHz Room Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML1_bm  (1<<1)  /* 24 MHz Room Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML1_bp  1  /* 24 MHz Room Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML2_bm  (1<<2)  /* 24 MHz Room Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML2_bp  2  /* 24 MHz Room Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML3_bm  (1<<3)  /* 24 MHz Room Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML3_bp  3  /* 24 MHz Room Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML4_bm  (1<<4)  /* 24 MHz Room Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML4_bp  4  /* 24 MHz Room Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML5_bm  (1<<5)  /* 24 MHz Room Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML5_bp  5  /* 24 MHz Room Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML6_bm  (1<<6)  /* 24 MHz Room Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML6_bp  6  /* 24 MHz Room Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML7_bm  (1<<7)  /* 24 MHz Room Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML7_bp  7  /* 24 MHz Room Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.RC24MHZROOMH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH_gm  0xFF  /* 24 MHz Room High Byte group mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH_gp  0  /* 24 MHz Room High Byte group position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH0_bm  (1<<0)  /* 24 MHz Room High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH0_bp  0  /* 24 MHz Room High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH1_bm  (1<<1)  /* 24 MHz Room High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH1_bp  1  /* 24 MHz Room High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH2_bm  (1<<2)  /* 24 MHz Room High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH2_bp  2  /* 24 MHz Room High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH3_bm  (1<<3)  /* 24 MHz Room High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH3_bp  3  /* 24 MHz Room High Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH4_bm  (1<<4)  /* 24 MHz Room High Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH4_bp  4  /* 24 MHz Room High Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH5_bm  (1<<5)  /* 24 MHz Room High Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH5_bp  5  /* 24 MHz Room High Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH6_bm  (1<<6)  /* 24 MHz Room High Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH6_bp  6  /* 24 MHz Room High Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH7_bm  (1<<7)  /* 24 MHz Room High Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH7_bp  7  /* 24 MHz Room High Byte bit 7 position. */

