gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* SIMULATOR - Simulator */
/* SIMULATOR.SIMCTRL0  bit masks and bit positions */
#define SIMULATOR_RXEDGE_NEG_bm  0x01  /* RX Negative Edge Detector bit mask. */
#define SIMULATOR_RXEDGE_NEG_bp  0  /* RX Negative Edge Detector bit position. */
#define SIMULATOR_RXEDGE_POS_bm  0x10  /* RX Positive Edge Detector bit mask. */
#define SIMULATOR_RXEDGE_POS_bp  4  /* RX Positive Edge Detector bit position. */

/* SIMULATOR.SIMCTRL1  bit masks and bit positions */
#define SIMULATOR_TXDATA_bm  0x01  /* TX HV Data bit mask. */
#define SIMULATOR_TXDATA_bp  0  /* TX HV Data bit position. */
#define SIMULATOR_TXHVSEL_bm  0x10  /* TX HV Select bit mask. */
#define SIMULATOR_TXHVSEL_bp  4  /* TX HV Select bit position. */

/* SLEEP - Sleep Controller */
/* SLEEP.CTRL  bit masks and bit positions */
#define SLEEP_SEN_bm  0x01  /* Sleep Enable bit mask. */
#define SLEEP_SEN_bp  0  /* Sleep Enable bit position. */
#define SLEEP_SMODE_gm  0x06  /* Sleep Mode Selection group mask. */
#define SLEEP_SMODE_gp  1  /* Sleep Mode Selection group position. */
#define SLEEP_SMODE0_bm  (1<<1)  /* Sleep Mode Selection bit 0 mask. */
#define SLEEP_SMODE0_bp  1  /* Sleep Mode Selection bit 0 position. */
#define SLEEP_SMODE1_bm  (1<<2)  /* Sleep Mode Selection bit 1 mask. */
#define SLEEP_SMODE1_bp  2  /* Sleep Mode Selection bit 1 position. */

/* STYLUSCOMIFV2 - Stylus Comif V2 */
/* STYLUSCOMIFV2.ANA_CTRLA  bit masks and bit positions */
#define STYLUSCOMIFV2_CEN_gm  0x03  /* Change Enable group mask. */
#define STYLUSCOMIFV2_CEN_gp  0  /* Change Enable group position. */
#define STYLUSCOMIFV2_CEN0_bm  (1<<0)  /* Change Enable bit 0 mask. */
#define STYLUSCOMIFV2_CEN0_bp  0  /* Change Enable bit 0 position. */
#define STYLUSCOMIFV2_CEN1_bm  (1<<1)  /* Change Enable bit 1 mask. */
#define STYLUSCOMIFV2_CEN1_bp  1  /* Change Enable bit 1 position. */

/* STYLUSCOMIFV2.ANA_CTRLB  bit masks and bit positions */
#define STYLUSCOMIFV2_TXEN_bm  0x02  /* TX Enable bit mask. */
#define STYLUSCOMIFV2_TXEN_bp  1  /* TX Enable bit position. */
#define STYLUSCOMIFV2_AMP1EN_bm  0x04  /* Amplifier 1 Enable bit mask. */
#define STYLUSCOMIFV2_AMP1EN_bp  2  /* Amplifier 1 Enable bit position. */
#define STYLUSCOMIFV2_AMP2EN_bm  0x08  /* Amplifier 2 Enable bit mask. */
#define STYLUSCOMIFV2_AMP2EN_bp  3  /* Amplifier 2 Enable bit position. */
#define STYLUSCOMIFV2_LBEN_bm  0x10  /* LDO Bypass Override Enable bit mask. */
#define STYLUSCOMIFV2_LBEN_bp  4  /* LDO Bypass Override Enable bit position. */
#define STYLUSCOMIFV2_NCMPEN_bm  0x20  /* Negative Edge Detector Enable bit mask. */
#define STYLUSCOMIFV2_NCMPEN_bp  5  /* Negative Edge Detector Enable bit position. */
#define STYLUSCOMIFV2_PCMPEN_bm  0x40  /* Positive Edge Detector Enable bit mask. */
#define STYLUSCOMIFV2_PCMPEN_bp  6  /* Positive Edge Detector Enable bit position. */
#define STYLUSCOMIFV2_BOEN_bm  0x80  /* Boost Override Enable bit mask. */
#define STYLUSCOMIFV2_BOEN_bp  7  /* Boost Override Enable bit position. */

/* STYLUSCOMIFV2.ANA_CTRLC  bit masks and bit positions */
#define STYLUSCOMIFV2_TXRSTLEV_bm  0x01  /* TX Reset Level bit mask. */
#define STYLUSCOMIFV2_TXRSTLEV_bp  0  /* TX Reset Level bit position. */
#define STYLUSCOMIFV2_RXTXSWEN_bm  0x02  /* RX/TX Switch Enable bit mask. */
#define STYLUSCOMIFV2_RXTXSWEN_bp  1  /* RX/TX Switch Enable bit position. */
#define STYLUSCOMIFV2_AMP1FILTER_bm  0x04  /* Amplifier 1 Filter bit mask. */
#define STYLUSCOMIFV2_AMP1FILTER_bp  2  /* Amplifier 1 Filter bit position. */
#define STYLUSCOMIFV2_AMP2FILTER_bm  0x08  /* Amplifier 2 Filter bit mask. */
#define STYLUSCOMIFV2_AMP2FILTER_bp  3  /* Amplifier 2 Filter bit position. */
#define STYLUSCOMIFV2_AMPBIAS_gm  0x30  /* Amplifier Bias group mask. */
#define STYLUSCOMIFV2_AMPBIAS_gp  4  /* Amplifier Bias group position. */
#define STYLUSCOMIFV2_AMPBIAS0_bm  (1<<4)  /* Amplifier Bias bit 0 mask. */
#define STYLUSCOMIFV2_AMPBIAS0_bp  4  /* Amplifier Bias bit 0 position. */
#define STYLUSCOMIFV2_AMPBIAS1_bm  (1<<5)  /* Amplifier Bias bit 1 mask. */
#define STYLUSCOMIFV2_AMPBIAS1_bp  5  /* Amplifier Bias bit 1 position. */
#define STYLUSCOMIFV2_TXAO_bm  0x80  /* Transmit auto off bit mask. */
#define STYLUSCOMIFV2_TXAO_bp  7  /* Transmit auto off bit position. */

/* STYLUSCOMIFV2.ANA_CTRLD  bit masks and bit positions */
#define STYLUSCOMIFV2_AMP1GAIN_gm  0x03  /* Amplifier 1 Gain group mask. */
#define STYLUSCOMIFV2_AMP1GAIN_gp  0  /* Amplifier 1 Gain group position. */
#define STYLUSCOMIFV2_AMP1GAIN0_bm  (1<<0)  /* Amplifier 1 Gain bit 0 mask. */
#define STYLUSCOMIFV2_AMP1GAIN0_bp  0  /* Amplifier 1 Gain bit 0 position. */
#define STYLUSCOMIFV2_AMP1GAIN1_bm  (1<<1)  /* Amplifier 1 Gain bit 1 mask. */
#define STYLUSCOMIFV2_AMP1GAIN1_bp  1  /* Amplifier 1 Gain bit 1 position. */
#define STYLUSCOMIFV2_AMP2GAIN_gm  0x7C  /* Amplifier 2 Gain group mask. */
#define STYLUSCOMIFV2_AMP2GAIN_gp  2  /* Amplifier 2 Gain group position. */
#define STYLUSCOMIFV2_AMP2GAIN0_bm  (1<<2)  /* Amplifier 2 Gain bit 0 mask. */
#define STYLUSCOMIFV2_AMP2GAIN0_bp  2  /* Amplifier 2 Gain bit 0 position. */
#define STYLUSCOMIFV2_AMP2GAIN1_bm  (1<<3)  /* Amplifier 2 Gain bit 1 mask. */
#define STYLUSCOMIFV2_AMP2GAIN1_bp  3  /* Amplifier 2 Gain bit 1 position. */
#define STYLUSCOMIFV2_AMP2GAIN2_bm  (1<<4)  /* Amplifier 2 Gain bit 2 mask. */
#define STYLUSCOMIFV2_AMP2GAIN2_bp  4  /* Amplifier 2 Gain bit 2 position. */
#define STYLUSCOMIFV2_AMP2GAIN3_bm  (1<<5)  /* Amplifier 2 Gain bit 3 mask. */
#define STYLUSCOMIFV2_AMP2GAIN3_bp  5  /* Amplifier 2 Gain bit 3 position. */
#define STYLUSCOMIFV2_AMP2GAIN4_bm  (1<<6)  /* Amplifier 2 Gain bit 4 mask. */
#define STYLUSCOMIFV2_AMP2GAIN4_bp  6  /* Amplifier 2 Gain bit 4 position. */

/* STYLUSCOMIFV2.ANA_CTRLE  bit masks and bit positions */
#define STYLUSCOMIFV2_RXBBYP_gm  0x03  /* RX Amplifier Bypass group mask. */
#define STYLUSCOMIFV2_RXBBYP_gp  0  /* RX Amplifier Bypass group position. */
#define STYLUSCOMIFV2_RXBBYP0_bm  (1<<0)  /* RX Amplifier Bypass bit 0 mask. */
#define STYLUSCOMIFV2_RXBBYP0_bp  0  /* RX Amplifier Bypass bit 0 position. */
#define STYLUSCOMIFV2_RXBBYP1_bm  (1<<1)  /* RX Amplifier Bypass bit 1 mask. */
#define STYLUSCOMIFV2_RXBBYP1_bp  1  /* RX Amplifier Bypass bit 1 position. */
#define STYLUSCOMIFV2_OFFSETCAL_gm  0xFC  /* Offset Calibration group mask. */
#define STYLUSCOMIFV2_OFFSETCAL_gp  2  /* Offset Calibration group position. */
#define STYLUSCOMIFV2_OFFSETCAL0_bm  (1<<2)  /* Offset Calibration bit 0 mask. */
#define STYLUSCOMIFV2_OFFSETCAL0_bp  2  /* Offset Calibration bit 0 position. */
#define STYLUSCOMIFV2_OFFSETCAL1_bm  (1<<3)  /* Offset Calibration bit 1 mask. */
#define STYLUSCOMIFV2_OFFSETCAL1_bp  3  /* Offset Calibration bit 1 position. */
#define STYLUSCOMIFV2_OFFSETCAL2_bm  (1<<4)  /* Offset Calibration bit 2 mask. */
#define STYLUSCOMIFV2_OFFSETCAL2_bp  4  /* Offset Calibration bit 2 position. */
#define STYLUSCOMIFV2_OFFSETCAL3_bm  (1<<5)  /* Offset Calibration bit 3 mask. */
#define STYLUSCOMIFV2_OFFSETCAL3_bp  5  /* Offset Calibration bit 3 position. */
#define STYLUSCOMIFV2_OFFSETCAL4_bm  (1<<6)  /* Offset Calibration bit 4 mask. */
#define STYLUSCOMIFV2_OFFSETCAL4_bp  6  /* Offset Calibration bit 4 position. */
#define STYLUSCOMIFV2_OFFSETCAL5_bm  (1<<7)  /* Offset Calibration bit 5 mask. */
#define STYLUSCOMIFV2_OFFSETCAL5_bp  7  /* Offset Calibration bit 5 position. */

/* STYLUSCOMIFV2.ANA_CTRLF  bit masks and bit positions */
#define STYLUSCOMIFV2_NTHRESHOLD_gm  0x07  /* Negative edge comparator Threshold group mask. */
#define STYLUSCOMIFV2_NTHRESHOLD_gp  0  /* Negative edge comparator Threshold group position. */
#define STYLUSCOMIFV2_NTHRESHOLD0_bm  (1<<0)  /* Negative edge comparator Threshold bit 0 mask. */
#define STYLUSCOMIFV2_NTHRESHOLD0_bp  0  /* Negative edge comparator Threshold bit 0 position. */
#define STYLUSCOMIFV2_NTHRESHOLD1_bm  (1<<1)  /* Negative edge comparator Threshold bit 1 mask. */
#define STYLUSCOMIFV2_NTHRESHOLD1_bp  1  /* Negative edge comparator Threshold bit 1 position. */
#define STYLUSCOMIFV2_NTHRESHOLD2_bm  (1<<2)  /* Negative edge comparator Threshold bit 2 mask. */
#define STYLUSCOMIFV2_NTHRESHOLD2_bp  2  /* Negative edge comparator Threshold bit 2 position. */
#define STYLUSCOMIFV2_PTHRESHOLD_gm  0x38  /* Positive edge comparator Threshold group mask. */
#define STYLUSCOMIFV2_PTHRESHOLD_gp  3  /* Positive edge comparator Threshold group position. */
#define STYLUSCOMIFV2_PTHRESHOLD0_bm  (1<<3)  /* Positive edge comparator Threshold bit 0 mask. */
#define STYLUSCOMIFV2_PTHRESHOLD0_bp  3  /* Positive edge comparator Threshold bit 0 position. */
#define STYLUSCOMIFV2_PTHRESHOLD1_bm  (1<<4)  /* Positive edge comparator Threshold bit 1 mask. */
#define STYLUSCOMIFV2_PTHRESHOLD1_bp  4  /* Positive edge comparator Threshold bit 1 position. */
#define STYLUSCOMIFV2_PTHRESHOLD2_bm  (1<<5)  /* Positive edge comparator Threshold bit 2 mask. */
#define STYLUSCOMIFV2_PTHRESHOLD2_bp  5  /* Positive edge comparator Threshold bit 2 position. */
#define STYLUSCOMIFV2_HYSTRST_bm  0x40  /* Hysteresis Reset bit mask. */
#define STYLUSCOMIFV2_HYSTRST_bp  6  /* Hysteresis Reset bit position. */
#define STYLUSCOMIFV2_ENHYST_bm  0x80  /* Hysteresis Enable bit mask. */
#define STYLUSCOMIFV2_ENHYST_bp  7  /* Hysteresis Enable bit position. */

