gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* STYLUSCOMIFV2.TMCTRLA  bit masks and bit positions */
#define STYLUSCOMIFV2_ENRXOVS_bm  0x01  /* Enable RX Override Signals bit mask. */
#define STYLUSCOMIFV2_ENRXOVS_bp  0  /* Enable RX Override Signals bit position. */
#define STYLUSCOMIFV2_OVRXDIS_bm  0x02  /* Override RX disable signal bit mask. */
#define STYLUSCOMIFV2_OVRXDIS_bp  1  /* Override RX disable signal bit position. */
#define STYLUSCOMIFV2_OVRXCLAMP_bm  0x04  /* Override RX clamp signal bit mask. */
#define STYLUSCOMIFV2_OVRXCLAMP_bp  2  /* Override RX clamp signal bit position. */
#define STYLUSCOMIFV2_AMPTOUT_bm  0x08  /* Amplifier test output enable bit mask. */
#define STYLUSCOMIFV2_AMPTOUT_bp  3  /* Amplifier test output enable bit position. */
#define STYLUSCOMIFV2_EDTIN_bm  0x20  /* Edge Detector Test Input enable Offset bit mask. */
#define STYLUSCOMIFV2_EDTIN_bp  5  /* Edge Detector Test Input enable Offset bit position. */
#define STYLUSCOMIFV2_FRESLADEN_bm  0x40  /* Force on edge detector RESistor LADder Enable bit mask. */
#define STYLUSCOMIFV2_FRESLADEN_bp  6  /* Force on edge detector RESistor LADder Enable bit position. */

/* STYLUSCOMIFV2.TMCTRLB  bit masks and bit positions */
#define STYLUSCOMIFV2_PBYPASS_bm  0x01  /* Peak Detector Bypass Enable bit mask. */
#define STYLUSCOMIFV2_PBYPASS_bp  0  /* Peak Detector Bypass Enable bit position. */
#define STYLUSCOMIFV2_PBUFEN_bm  0x02  /* Peak Detector Output Buffer enable bit mask. */
#define STYLUSCOMIFV2_PBUFEN_bp  1  /* Peak Detector Output Buffer enable bit position. */
#define STYLUSCOMIFV2_FRXTXSWEN_bm  0x04  /* Force RXTX switch enbale bit mask. */
#define STYLUSCOMIFV2_FRXTXSWEN_bp  2  /* Force RXTX switch enbale bit position. */
#define STYLUSCOMIFV2_TXOM_bm  0x10  /* TX only mode bit mask. */
#define STYLUSCOMIFV2_TXOM_bp  4  /* TX only mode bit position. */
#define STYLUSCOMIFV2_BYP_DE_bm  0x40  /* Bypass DE bit mask. */
#define STYLUSCOMIFV2_BYP_DE_bp  6  /* Bypass DE bit position. */
#define STYLUSCOMIFV2_BYP_L_bm  0x80  /* Bypass L bit mask. */
#define STYLUSCOMIFV2_BYP_L_bp  7  /* Bypass L bit position. */

/* STYLUSCOMIFV2.TMCTRLC  bit masks and bit positions */
#define STYLUSCOMIFV2_TBUS_SELA_gm  0x0F  /* Digital testbus select a group mask. */
#define STYLUSCOMIFV2_TBUS_SELA_gp  0  /* Digital testbus select a group position. */
#define STYLUSCOMIFV2_TBUS_SELA0_bm  (1<<0)  /* Digital testbus select a bit 0 mask. */
#define STYLUSCOMIFV2_TBUS_SELA0_bp  0  /* Digital testbus select a bit 0 position. */
#define STYLUSCOMIFV2_TBUS_SELA1_bm  (1<<1)  /* Digital testbus select a bit 1 mask. */
#define STYLUSCOMIFV2_TBUS_SELA1_bp  1  /* Digital testbus select a bit 1 position. */
#define STYLUSCOMIFV2_TBUS_SELA2_bm  (1<<2)  /* Digital testbus select a bit 2 mask. */
#define STYLUSCOMIFV2_TBUS_SELA2_bp  2  /* Digital testbus select a bit 2 position. */
#define STYLUSCOMIFV2_TBUS_SELA3_bm  (1<<3)  /* Digital testbus select a bit 3 mask. */
#define STYLUSCOMIFV2_TBUS_SELA3_bp  3  /* Digital testbus select a bit 3 position. */
#define STYLUSCOMIFV2_TBUS_SELB_gm  0xF0  /* Digital testbus select b group mask. */
#define STYLUSCOMIFV2_TBUS_SELB_gp  4  /* Digital testbus select b group position. */
#define STYLUSCOMIFV2_TBUS_SELB0_bm  (1<<4)  /* Digital testbus select b bit 0 mask. */
#define STYLUSCOMIFV2_TBUS_SELB0_bp  4  /* Digital testbus select b bit 0 position. */
#define STYLUSCOMIFV2_TBUS_SELB1_bm  (1<<5)  /* Digital testbus select b bit 1 mask. */
#define STYLUSCOMIFV2_TBUS_SELB1_bp  5  /* Digital testbus select b bit 1 position. */
#define STYLUSCOMIFV2_TBUS_SELB2_bm  (1<<6)  /* Digital testbus select b bit 2 mask. */
#define STYLUSCOMIFV2_TBUS_SELB2_bp  6  /* Digital testbus select b bit 2 position. */
#define STYLUSCOMIFV2_TBUS_SELB3_bm  (1<<7)  /* Digital testbus select b bit 3 mask. */
#define STYLUSCOMIFV2_TBUS_SELB3_bp  7  /* Digital testbus select b bit 3 position. */

/* STYLUSCOMIFV2.RX_MODE  bit masks and bit positions */
#define STYLUSCOMIFV2_AUTODISRX_gm  0x03  /* Auto Disable RX group mask. */
#define STYLUSCOMIFV2_AUTODISRX_gp  0  /* Auto Disable RX group position. */
#define STYLUSCOMIFV2_AUTODISRX0_bm  (1<<0)  /* Auto Disable RX bit 0 mask. */
#define STYLUSCOMIFV2_AUTODISRX0_bp  0  /* Auto Disable RX bit 0 position. */
#define STYLUSCOMIFV2_AUTODISRX1_bm  (1<<1)  /* Auto Disable RX bit 1 mask. */
#define STYLUSCOMIFV2_AUTODISRX1_bp  1  /* Auto Disable RX bit 1 position. */
#define STYLUSCOMIFV2_MODE_DIGITAL_gm  0x0C  /* Digital Mode group mask. */
#define STYLUSCOMIFV2_MODE_DIGITAL_gp  2  /* Digital Mode group position. */
#define STYLUSCOMIFV2_MODE_DIGITAL0_bm  (1<<2)  /* Digital Mode bit 0 mask. */
#define STYLUSCOMIFV2_MODE_DIGITAL0_bp  2  /* Digital Mode bit 0 position. */
#define STYLUSCOMIFV2_MODE_DIGITAL1_bm  (1<<3)  /* Digital Mode bit 1 mask. */
#define STYLUSCOMIFV2_MODE_DIGITAL1_bp  3  /* Digital Mode bit 1 position. */
#define STYLUSCOMIFV2_CORR_MODE_gm  0x30  /* Correlator Mode group mask. */
#define STYLUSCOMIFV2_CORR_MODE_gp  4  /* Correlator Mode group position. */
#define STYLUSCOMIFV2_CORR_MODE0_bm  (1<<4)  /* Correlator Mode bit 0 mask. */
#define STYLUSCOMIFV2_CORR_MODE0_bp  4  /* Correlator Mode bit 0 position. */
#define STYLUSCOMIFV2_CORR_MODE1_bm  (1<<5)  /* Correlator Mode bit 1 mask. */
#define STYLUSCOMIFV2_CORR_MODE1_bp  5  /* Correlator Mode bit 1 position. */

/* STYLUSCOMIFV2.RX_CTRLA  bit masks and bit positions */
#define STYLUSCOMIFV2_HS_gm  0x3F  /* Header Size group mask. */
#define STYLUSCOMIFV2_HS_gp  0  /* Header Size group position. */
#define STYLUSCOMIFV2_HS0_bm  (1<<0)  /* Header Size bit 0 mask. */
#define STYLUSCOMIFV2_HS0_bp  0  /* Header Size bit 0 position. */
#define STYLUSCOMIFV2_HS1_bm  (1<<1)  /* Header Size bit 1 mask. */
#define STYLUSCOMIFV2_HS1_bp  1  /* Header Size bit 1 position. */
#define STYLUSCOMIFV2_HS2_bm  (1<<2)  /* Header Size bit 2 mask. */
#define STYLUSCOMIFV2_HS2_bp  2  /* Header Size bit 2 position. */
#define STYLUSCOMIFV2_HS3_bm  (1<<3)  /* Header Size bit 3 mask. */
#define STYLUSCOMIFV2_HS3_bp  3  /* Header Size bit 3 position. */
#define STYLUSCOMIFV2_HS4_bm  (1<<4)  /* Header Size bit 4 mask. */
#define STYLUSCOMIFV2_HS4_bp  4  /* Header Size bit 4 position. */
#define STYLUSCOMIFV2_HS5_bm  (1<<5)  /* Header Size bit 5 mask. */
#define STYLUSCOMIFV2_HS5_bp  5  /* Header Size bit 5 position. */
#define STYLUSCOMIFV2_HFES_bm  0x40  /* Header First edge start bit mask. */
#define STYLUSCOMIFV2_HFES_bp  6  /* Header First edge start bit position. */
#define STYLUSCOMIFV2_CLHEN_bm  0x80  /* Clamptip in Header enable bit mask. */
#define STYLUSCOMIFV2_CLHEN_bp  7  /* Clamptip in Header enable bit position. */

/* STYLUSCOMIFV2.RX_CTRLB  bit masks and bit positions */
#define STYLUSCOMIFV2_EDFILTEN_bm  0x01  /* Digital edge detector filter enable bit mask. */
#define STYLUSCOMIFV2_EDFILTEN_bp  0  /* Digital edge detector filter enable bit position. */
#define STYLUSCOMIFV2_FCNT_gm  0x7E  /* Filter count value group mask. */
#define STYLUSCOMIFV2_FCNT_gp  1  /* Filter count value group position. */
#define STYLUSCOMIFV2_FCNT0_bm  (1<<1)  /* Filter count value bit 0 mask. */
#define STYLUSCOMIFV2_FCNT0_bp  1  /* Filter count value bit 0 position. */
#define STYLUSCOMIFV2_FCNT1_bm  (1<<2)  /* Filter count value bit 1 mask. */
#define STYLUSCOMIFV2_FCNT1_bp  2  /* Filter count value bit 1 position. */
#define STYLUSCOMIFV2_FCNT2_bm  (1<<3)  /* Filter count value bit 2 mask. */
#define STYLUSCOMIFV2_FCNT2_bp  3  /* Filter count value bit 2 position. */
#define STYLUSCOMIFV2_FCNT3_bm  (1<<4)  /* Filter count value bit 3 mask. */
#define STYLUSCOMIFV2_FCNT3_bp  4  /* Filter count value bit 3 position. */
#define STYLUSCOMIFV2_FCNT4_bm  (1<<5)  /* Filter count value bit 4 mask. */
#define STYLUSCOMIFV2_FCNT4_bp  5  /* Filter count value bit 4 position. */
#define STYLUSCOMIFV2_FCNT5_bm  (1<<6)  /* Filter count value bit 5 mask. */
#define STYLUSCOMIFV2_FCNT5_bp  6  /* Filter count value bit 5 position. */

/* STYLUSCOMIFV2.DLYLINE0CTRLA  bit masks and bit positions */
#define STYLUSCOMIFV2_WINCOEFF1_gm  0xFF  /* Window Coefficient 1 group mask. */
#define STYLUSCOMIFV2_WINCOEFF1_gp  0  /* Window Coefficient 1 group position. */
#define STYLUSCOMIFV2_WINCOEFF10_bm  (1<<0)  /* Window Coefficient 1 bit 0 mask. */
#define STYLUSCOMIFV2_WINCOEFF10_bp  0  /* Window Coefficient 1 bit 0 position. */
#define STYLUSCOMIFV2_WINCOEFF11_bm  (1<<1)  /* Window Coefficient 1 bit 1 mask. */
#define STYLUSCOMIFV2_WINCOEFF11_bp  1  /* Window Coefficient 1 bit 1 position. */
#define STYLUSCOMIFV2_WINCOEFF12_bm  (1<<2)  /* Window Coefficient 1 bit 2 mask. */
#define STYLUSCOMIFV2_WINCOEFF12_bp  2  /* Window Coefficient 1 bit 2 position. */
#define STYLUSCOMIFV2_WINCOEFF13_bm  (1<<3)  /* Window Coefficient 1 bit 3 mask. */
#define STYLUSCOMIFV2_WINCOEFF13_bp  3  /* Window Coefficient 1 bit 3 position. */
#define STYLUSCOMIFV2_WINCOEFF14_bm  (1<<4)  /* Window Coefficient 1 bit 4 mask. */
#define STYLUSCOMIFV2_WINCOEFF14_bp  4  /* Window Coefficient 1 bit 4 position. */
#define STYLUSCOMIFV2_WINCOEFF15_bm  (1<<5)  /* Window Coefficient 1 bit 5 mask. */
#define STYLUSCOMIFV2_WINCOEFF15_bp  5  /* Window Coefficient 1 bit 5 position. */
#define STYLUSCOMIFV2_WINCOEFF16_bm  (1<<6)  /* Window Coefficient 1 bit 6 mask. */
#define STYLUSCOMIFV2_WINCOEFF16_bp  6  /* Window Coefficient 1 bit 6 position. */
#define STYLUSCOMIFV2_WINCOEFF17_bm  (1<<7)  /* Window Coefficient 1 bit 7 mask. */
#define STYLUSCOMIFV2_WINCOEFF17_bp  7  /* Window Coefficient 1 bit 7 position. */

