gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* STYLUSCOMIFV2.DLYLINE0CTRLB  bit masks and bit positions */
#define STYLUSCOMIFV2_WINCOEFF2_gm  0xFF  /* Window Coefficient 2 group mask. */
#define STYLUSCOMIFV2_WINCOEFF2_gp  0  /* Window Coefficient 2 group position. */
#define STYLUSCOMIFV2_WINCOEFF20_bm  (1<<0)  /* Window Coefficient 2 bit 0 mask. */
#define STYLUSCOMIFV2_WINCOEFF20_bp  0  /* Window Coefficient 2 bit 0 position. */
#define STYLUSCOMIFV2_WINCOEFF21_bm  (1<<1)  /* Window Coefficient 2 bit 1 mask. */
#define STYLUSCOMIFV2_WINCOEFF21_bp  1  /* Window Coefficient 2 bit 1 position. */
#define STYLUSCOMIFV2_WINCOEFF22_bm  (1<<2)  /* Window Coefficient 2 bit 2 mask. */
#define STYLUSCOMIFV2_WINCOEFF22_bp  2  /* Window Coefficient 2 bit 2 position. */
#define STYLUSCOMIFV2_WINCOEFF23_bm  (1<<3)  /* Window Coefficient 2 bit 3 mask. */
#define STYLUSCOMIFV2_WINCOEFF23_bp  3  /* Window Coefficient 2 bit 3 position. */
#define STYLUSCOMIFV2_WINCOEFF24_bm  (1<<4)  /* Window Coefficient 2 bit 4 mask. */
#define STYLUSCOMIFV2_WINCOEFF24_bp  4  /* Window Coefficient 2 bit 4 position. */
#define STYLUSCOMIFV2_WINCOEFF25_bm  (1<<5)  /* Window Coefficient 2 bit 5 mask. */
#define STYLUSCOMIFV2_WINCOEFF25_bp  5  /* Window Coefficient 2 bit 5 position. */
#define STYLUSCOMIFV2_WINCOEFF26_bm  (1<<6)  /* Window Coefficient 2 bit 6 mask. */
#define STYLUSCOMIFV2_WINCOEFF26_bp  6  /* Window Coefficient 2 bit 6 position. */
#define STYLUSCOMIFV2_WINCOEFF27_bm  (1<<7)  /* Window Coefficient 2 bit 7 mask. */
#define STYLUSCOMIFV2_WINCOEFF27_bp  7  /* Window Coefficient 2 bit 7 position. */

/* STYLUSCOMIFV2.DLYLINE0CTRLC  bit masks and bit positions */
#define STYLUSCOMIFV2_DLY_gm  0x3F  /* Delay group mask. */
#define STYLUSCOMIFV2_DLY_gp  0  /* Delay group position. */
#define STYLUSCOMIFV2_DLY0_bm  (1<<0)  /* Delay bit 0 mask. */
#define STYLUSCOMIFV2_DLY0_bp  0  /* Delay bit 0 position. */
#define STYLUSCOMIFV2_DLY1_bm  (1<<1)  /* Delay bit 1 mask. */
#define STYLUSCOMIFV2_DLY1_bp  1  /* Delay bit 1 position. */
#define STYLUSCOMIFV2_DLY2_bm  (1<<2)  /* Delay bit 2 mask. */
#define STYLUSCOMIFV2_DLY2_bp  2  /* Delay bit 2 position. */
#define STYLUSCOMIFV2_DLY3_bm  (1<<3)  /* Delay bit 3 mask. */
#define STYLUSCOMIFV2_DLY3_bp  3  /* Delay bit 3 position. */
#define STYLUSCOMIFV2_DLY4_bm  (1<<4)  /* Delay bit 4 mask. */
#define STYLUSCOMIFV2_DLY4_bp  4  /* Delay bit 4 position. */
#define STYLUSCOMIFV2_DLY5_bm  (1<<5)  /* Delay bit 5 mask. */
#define STYLUSCOMIFV2_DLY5_bp  5  /* Delay bit 5 position. */
#define STYLUSCOMIFV2_DIS_ECORR_bm  0x80  /* Delay bit mask. */
#define STYLUSCOMIFV2_DIS_ECORR_bp  7  /* Delay bit position. */

/* STYLUSCOMIFV2.DLYLINE1CTRLA  bit masks and bit positions */
/* STYLUSCOMIFV2_WINCOEFF1  is already defined. */

/* STYLUSCOMIFV2.DLYLINE1CTRLB  bit masks and bit positions */
/* STYLUSCOMIFV2_WINCOEFF2  is already defined. */

/* STYLUSCOMIFV2.DLYLINE1CTRLC  bit masks and bit positions */
/* STYLUSCOMIFV2_DLY  is already defined. */
/* STYLUSCOMIFV2_DIS_ECORR  is already defined. */

/* STYLUSCOMIFV2.DLYLINE2CTRLA  bit masks and bit positions */
/* STYLUSCOMIFV2_WINCOEFF1  is already defined. */

/* STYLUSCOMIFV2.DLYLINE2CTRLB  bit masks and bit positions */
/* STYLUSCOMIFV2_WINCOEFF2  is already defined. */

/* STYLUSCOMIFV2.DLYLINE2CTRLC  bit masks and bit positions */
/* STYLUSCOMIFV2_DLY  is already defined. */
/* STYLUSCOMIFV2_DIS_ECORR  is already defined. */

/* STYLUSCOMIFV2.DLYLINE_SIGN  bit masks and bit positions */
#define STYLUSCOMIFV2_CORR_SIGN_gm  0x3F  /* Signs for the different delaylines group mask. */
#define STYLUSCOMIFV2_CORR_SIGN_gp  0  /* Signs for the different delaylines group position. */
#define STYLUSCOMIFV2_CORR_SIGN0_bm  (1<<0)  /* Signs for the different delaylines bit 0 mask. */
#define STYLUSCOMIFV2_CORR_SIGN0_bp  0  /* Signs for the different delaylines bit 0 position. */
#define STYLUSCOMIFV2_CORR_SIGN1_bm  (1<<1)  /* Signs for the different delaylines bit 1 mask. */
#define STYLUSCOMIFV2_CORR_SIGN1_bp  1  /* Signs for the different delaylines bit 1 position. */
#define STYLUSCOMIFV2_CORR_SIGN2_bm  (1<<2)  /* Signs for the different delaylines bit 2 mask. */
#define STYLUSCOMIFV2_CORR_SIGN2_bp  2  /* Signs for the different delaylines bit 2 position. */
#define STYLUSCOMIFV2_CORR_SIGN3_bm  (1<<3)  /* Signs for the different delaylines bit 3 mask. */
#define STYLUSCOMIFV2_CORR_SIGN3_bp  3  /* Signs for the different delaylines bit 3 position. */
#define STYLUSCOMIFV2_CORR_SIGN4_bm  (1<<4)  /* Signs for the different delaylines bit 4 mask. */
#define STYLUSCOMIFV2_CORR_SIGN4_bp  4  /* Signs for the different delaylines bit 4 position. */
#define STYLUSCOMIFV2_CORR_SIGN5_bm  (1<<5)  /* Signs for the different delaylines bit 5 mask. */
#define STYLUSCOMIFV2_CORR_SIGN5_bp  5  /* Signs for the different delaylines bit 5 position. */

/* STYLUSCOMIFV2.XCORRCTRLA  bit masks and bit positions */
#define STYLUSCOMIFV2_LOCKCNTEN_bm  0x01  /* Lock Count Enable bit mask. */
#define STYLUSCOMIFV2_LOCKCNTEN_bp  0  /* Lock Count Enable bit position. */
#define STYLUSCOMIFV2_GCUTRED_bm  0x02  /* Grass-cut RED bit mask. */
#define STYLUSCOMIFV2_GCUTRED_bp  1  /* Grass-cut RED bit position. */
#define STYLUSCOMIFV2_TEM_bm  0x04  /* Transmit at estimated edge mid value bit mask. */
#define STYLUSCOMIFV2_TEM_bp  2  /* Transmit at estimated edge mid value bit position. */
#define STYLUSCOMIFV2_GCUTLIM_gm  0x70  /* Grass-cut Limit group mask. */
#define STYLUSCOMIFV2_GCUTLIM_gp  4  /* Grass-cut Limit group position. */
#define STYLUSCOMIFV2_GCUTLIM0_bm  (1<<4)  /* Grass-cut Limit bit 0 mask. */
#define STYLUSCOMIFV2_GCUTLIM0_bp  4  /* Grass-cut Limit bit 0 position. */
#define STYLUSCOMIFV2_GCUTLIM1_bm  (1<<5)  /* Grass-cut Limit bit 1 mask. */
#define STYLUSCOMIFV2_GCUTLIM1_bp  5  /* Grass-cut Limit bit 1 position. */
#define STYLUSCOMIFV2_GCUTLIM2_bm  (1<<6)  /* Grass-cut Limit bit 2 mask. */
#define STYLUSCOMIFV2_GCUTLIM2_bp  6  /* Grass-cut Limit bit 2 position. */

/* STYLUSCOMIFV2.XCORRCTRLB  bit masks and bit positions */
#define STYLUSCOMIFV2_WINSIZE_gm  0x0F  /* Window Size group mask. */
#define STYLUSCOMIFV2_WINSIZE_gp  0  /* Window Size group position. */
#define STYLUSCOMIFV2_WINSIZE0_bm  (1<<0)  /* Window Size bit 0 mask. */
#define STYLUSCOMIFV2_WINSIZE0_bp  0  /* Window Size bit 0 position. */
#define STYLUSCOMIFV2_WINSIZE1_bm  (1<<1)  /* Window Size bit 1 mask. */
#define STYLUSCOMIFV2_WINSIZE1_bp  1  /* Window Size bit 1 position. */
#define STYLUSCOMIFV2_WINSIZE2_bm  (1<<2)  /* Window Size bit 2 mask. */
#define STYLUSCOMIFV2_WINSIZE2_bp  2  /* Window Size bit 2 position. */
#define STYLUSCOMIFV2_WINSIZE3_bm  (1<<3)  /* Window Size bit 3 mask. */
#define STYLUSCOMIFV2_WINSIZE3_bp  3  /* Window Size bit 3 position. */
#define STYLUSCOMIFV2_LOCKCNT_TOP_gm  0xF0  /* Lock counter max value group mask. */
#define STYLUSCOMIFV2_LOCKCNT_TOP_gp  4  /* Lock counter max value group position. */
#define STYLUSCOMIFV2_LOCKCNT_TOP0_bm  (1<<4)  /* Lock counter max value bit 0 mask. */
#define STYLUSCOMIFV2_LOCKCNT_TOP0_bp  4  /* Lock counter max value bit 0 position. */
#define STYLUSCOMIFV2_LOCKCNT_TOP1_bm  (1<<5)  /* Lock counter max value bit 1 mask. */
#define STYLUSCOMIFV2_LOCKCNT_TOP1_bp  5  /* Lock counter max value bit 1 position. */
#define STYLUSCOMIFV2_LOCKCNT_TOP2_bm  (1<<6)  /* Lock counter max value bit 2 mask. */
#define STYLUSCOMIFV2_LOCKCNT_TOP2_bp  6  /* Lock counter max value bit 2 position. */
#define STYLUSCOMIFV2_LOCKCNT_TOP3_bm  (1<<7)  /* Lock counter max value bit 3 mask. */
#define STYLUSCOMIFV2_LOCKCNT_TOP3_bp  7  /* Lock counter max value bit 3 position. */

/* STYLUSCOMIFV2.XCORRCTRLC  bit masks and bit positions */
#define STYLUSCOMIFV2_EXPPER_gm  0xFF  /* Expected Periods group mask. */
#define STYLUSCOMIFV2_EXPPER_gp  0  /* Expected Periods group position. */
#define STYLUSCOMIFV2_EXPPER0_bm  (1<<0)  /* Expected Periods bit 0 mask. */
#define STYLUSCOMIFV2_EXPPER0_bp  0  /* Expected Periods bit 0 position. */
#define STYLUSCOMIFV2_EXPPER1_bm  (1<<1)  /* Expected Periods bit 1 mask. */
#define STYLUSCOMIFV2_EXPPER1_bp  1  /* Expected Periods bit 1 position. */
#define STYLUSCOMIFV2_EXPPER2_bm  (1<<2)  /* Expected Periods bit 2 mask. */
#define STYLUSCOMIFV2_EXPPER2_bp  2  /* Expected Periods bit 2 position. */
#define STYLUSCOMIFV2_EXPPER3_bm  (1<<3)  /* Expected Periods bit 3 mask. */
#define STYLUSCOMIFV2_EXPPER3_bp  3  /* Expected Periods bit 3 position. */
#define STYLUSCOMIFV2_EXPPER4_bm  (1<<4)  /* Expected Periods bit 4 mask. */
#define STYLUSCOMIFV2_EXPPER4_bp  4  /* Expected Periods bit 4 position. */
#define STYLUSCOMIFV2_EXPPER5_bm  (1<<5)  /* Expected Periods bit 5 mask. */
#define STYLUSCOMIFV2_EXPPER5_bp  5  /* Expected Periods bit 5 position. */
#define STYLUSCOMIFV2_EXPPER6_bm  (1<<6)  /* Expected Periods bit 6 mask. */
#define STYLUSCOMIFV2_EXPPER6_bp  6  /* Expected Periods bit 6 position. */
#define STYLUSCOMIFV2_EXPPER7_bm  (1<<7)  /* Expected Periods bit 7 mask. */
#define STYLUSCOMIFV2_EXPPER7_bp  7  /* Expected Periods bit 7 position. */

