gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* STYLUSCOMIFV2.TIMACCUL  bit masks and bit positions */
#define STYLUSCOMIFV2_TIMACCUL_gm  0xFF  /* Timer Accumulator group mask. */
#define STYLUSCOMIFV2_TIMACCUL_gp  0  /* Timer Accumulator group position. */
#define STYLUSCOMIFV2_TIMACCUL0_bm  (1<<0)  /* Timer Accumulator bit 0 mask. */
#define STYLUSCOMIFV2_TIMACCUL0_bp  0  /* Timer Accumulator bit 0 position. */
#define STYLUSCOMIFV2_TIMACCUL1_bm  (1<<1)  /* Timer Accumulator bit 1 mask. */
#define STYLUSCOMIFV2_TIMACCUL1_bp  1  /* Timer Accumulator bit 1 position. */
#define STYLUSCOMIFV2_TIMACCUL2_bm  (1<<2)  /* Timer Accumulator bit 2 mask. */
#define STYLUSCOMIFV2_TIMACCUL2_bp  2  /* Timer Accumulator bit 2 position. */
#define STYLUSCOMIFV2_TIMACCUL3_bm  (1<<3)  /* Timer Accumulator bit 3 mask. */
#define STYLUSCOMIFV2_TIMACCUL3_bp  3  /* Timer Accumulator bit 3 position. */
#define STYLUSCOMIFV2_TIMACCUL4_bm  (1<<4)  /* Timer Accumulator bit 4 mask. */
#define STYLUSCOMIFV2_TIMACCUL4_bp  4  /* Timer Accumulator bit 4 position. */
#define STYLUSCOMIFV2_TIMACCUL5_bm  (1<<5)  /* Timer Accumulator bit 5 mask. */
#define STYLUSCOMIFV2_TIMACCUL5_bp  5  /* Timer Accumulator bit 5 position. */
#define STYLUSCOMIFV2_TIMACCUL6_bm  (1<<6)  /* Timer Accumulator bit 6 mask. */
#define STYLUSCOMIFV2_TIMACCUL6_bp  6  /* Timer Accumulator bit 6 position. */
#define STYLUSCOMIFV2_TIMACCUL7_bm  (1<<7)  /* Timer Accumulator bit 7 mask. */
#define STYLUSCOMIFV2_TIMACCUL7_bp  7  /* Timer Accumulator bit 7 position. */

/* STYLUSCOMIFV2.TIMACCUH  bit masks and bit positions */
#define STYLUSCOMIFV2_TIMACCUH_gm  0xFF  /* Timer Accumulator group mask. */
#define STYLUSCOMIFV2_TIMACCUH_gp  0  /* Timer Accumulator group position. */
#define STYLUSCOMIFV2_TIMACCUH0_bm  (1<<0)  /* Timer Accumulator bit 0 mask. */
#define STYLUSCOMIFV2_TIMACCUH0_bp  0  /* Timer Accumulator bit 0 position. */
#define STYLUSCOMIFV2_TIMACCUH1_bm  (1<<1)  /* Timer Accumulator bit 1 mask. */
#define STYLUSCOMIFV2_TIMACCUH1_bp  1  /* Timer Accumulator bit 1 position. */
#define STYLUSCOMIFV2_TIMACCUH2_bm  (1<<2)  /* Timer Accumulator bit 2 mask. */
#define STYLUSCOMIFV2_TIMACCUH2_bp  2  /* Timer Accumulator bit 2 position. */
#define STYLUSCOMIFV2_TIMACCUH3_bm  (1<<3)  /* Timer Accumulator bit 3 mask. */
#define STYLUSCOMIFV2_TIMACCUH3_bp  3  /* Timer Accumulator bit 3 position. */
#define STYLUSCOMIFV2_TIMACCUH4_bm  (1<<4)  /* Timer Accumulator bit 4 mask. */
#define STYLUSCOMIFV2_TIMACCUH4_bp  4  /* Timer Accumulator bit 4 position. */
#define STYLUSCOMIFV2_TIMACCUH5_bm  (1<<5)  /* Timer Accumulator bit 5 mask. */
#define STYLUSCOMIFV2_TIMACCUH5_bp  5  /* Timer Accumulator bit 5 position. */
#define STYLUSCOMIFV2_TIMACCUH6_bm  (1<<6)  /* Timer Accumulator bit 6 mask. */
#define STYLUSCOMIFV2_TIMACCUH6_bp  6  /* Timer Accumulator bit 6 position. */
#define STYLUSCOMIFV2_TIMACCUH7_bm  (1<<7)  /* Timer Accumulator bit 7 mask. */
#define STYLUSCOMIFV2_TIMACCUH7_bp  7  /* Timer Accumulator bit 7 position. */

/* STYLUSCOMIFV2.ACCUCNT  bit masks and bit positions */
#define STYLUSCOMIFV2_ACCUCNT_gm  0x7F  /* ACCUCNT group mask. */
#define STYLUSCOMIFV2_ACCUCNT_gp  0  /* ACCUCNT group position. */
#define STYLUSCOMIFV2_ACCUCNT0_bm  (1<<0)  /* ACCUCNT bit 0 mask. */
#define STYLUSCOMIFV2_ACCUCNT0_bp  0  /* ACCUCNT bit 0 position. */
#define STYLUSCOMIFV2_ACCUCNT1_bm  (1<<1)  /* ACCUCNT bit 1 mask. */
#define STYLUSCOMIFV2_ACCUCNT1_bp  1  /* ACCUCNT bit 1 position. */
#define STYLUSCOMIFV2_ACCUCNT2_bm  (1<<2)  /* ACCUCNT bit 2 mask. */
#define STYLUSCOMIFV2_ACCUCNT2_bp  2  /* ACCUCNT bit 2 position. */
#define STYLUSCOMIFV2_ACCUCNT3_bm  (1<<3)  /* ACCUCNT bit 3 mask. */
#define STYLUSCOMIFV2_ACCUCNT3_bp  3  /* ACCUCNT bit 3 position. */
#define STYLUSCOMIFV2_ACCUCNT4_bm  (1<<4)  /* ACCUCNT bit 4 mask. */
#define STYLUSCOMIFV2_ACCUCNT4_bp  4  /* ACCUCNT bit 4 position. */
#define STYLUSCOMIFV2_ACCUCNT5_bm  (1<<5)  /* ACCUCNT bit 5 mask. */
#define STYLUSCOMIFV2_ACCUCNT5_bp  5  /* ACCUCNT bit 5 position. */
#define STYLUSCOMIFV2_ACCUCNT6_bm  (1<<6)  /* ACCUCNT bit 6 mask. */
#define STYLUSCOMIFV2_ACCUCNT6_bp  6  /* ACCUCNT bit 6 position. */

/* STYLUSCOMIFV2.TXCTRLA  bit masks and bit positions */
#define STYLUSCOMIFV2_TSP_bm  0x10  /* Transmission Signal Polarity bit mask. */
#define STYLUSCOMIFV2_TSP_bp  4  /* Transmission Signal Polarity bit position. */
#define STYLUSCOMIFV2_TOVE_bm  0x40  /* Transmit Override Enable bit mask. */
#define STYLUSCOMIFV2_TOVE_bp  6  /* Transmit Override Enable bit position. */
#define STYLUSCOMIFV2_TPDEN_bm  0x80  /* Transmit Pulldown Enable bit mask. */
#define STYLUSCOMIFV2_TPDEN_bp  7  /* Transmit Pulldown Enable bit position. */

/* STYLUSCOMIFV2.TXCTRLB  bit masks and bit positions */
#define STYLUSCOMIFV2_TXFRACTDIV_gm  0x07  /* TX Fraction Divide group mask. */
#define STYLUSCOMIFV2_TXFRACTDIV_gp  0  /* TX Fraction Divide group position. */
#define STYLUSCOMIFV2_TXFRACTDIV0_bm  (1<<0)  /* TX Fraction Divide bit 0 mask. */
#define STYLUSCOMIFV2_TXFRACTDIV0_bp  0  /* TX Fraction Divide bit 0 position. */
#define STYLUSCOMIFV2_TXFRACTDIV1_bm  (1<<1)  /* TX Fraction Divide bit 1 mask. */
#define STYLUSCOMIFV2_TXFRACTDIV1_bp  1  /* TX Fraction Divide bit 1 position. */
#define STYLUSCOMIFV2_TXFRACTDIV2_bm  (1<<2)  /* TX Fraction Divide bit 2 mask. */
#define STYLUSCOMIFV2_TXFRACTDIV2_bp  2  /* TX Fraction Divide bit 2 position. */

/* STYLUSCOMIFV2.TDS  bit masks and bit positions */
#define STYLUSCOMIFV2_DATASIZE_gm  0x3F  /* Datasize group mask. */
#define STYLUSCOMIFV2_DATASIZE_gp  0  /* Datasize group position. */
#define STYLUSCOMIFV2_DATASIZE0_bm  (1<<0)  /* Datasize bit 0 mask. */
#define STYLUSCOMIFV2_DATASIZE0_bp  0  /* Datasize bit 0 position. */
#define STYLUSCOMIFV2_DATASIZE1_bm  (1<<1)  /* Datasize bit 1 mask. */
#define STYLUSCOMIFV2_DATASIZE1_bp  1  /* Datasize bit 1 position. */
#define STYLUSCOMIFV2_DATASIZE2_bm  (1<<2)  /* Datasize bit 2 mask. */
#define STYLUSCOMIFV2_DATASIZE2_bp  2  /* Datasize bit 2 position. */
#define STYLUSCOMIFV2_DATASIZE3_bm  (1<<3)  /* Datasize bit 3 mask. */
#define STYLUSCOMIFV2_DATASIZE3_bp  3  /* Datasize bit 3 position. */
#define STYLUSCOMIFV2_DATASIZE4_bm  (1<<4)  /* Datasize bit 4 mask. */
#define STYLUSCOMIFV2_DATASIZE4_bp  4  /* Datasize bit 4 position. */
#define STYLUSCOMIFV2_DATASIZE5_bm  (1<<5)  /* Datasize bit 5 mask. */
#define STYLUSCOMIFV2_DATASIZE5_bp  5  /* Datasize bit 5 position. */

/* STYLUSCOMIFV2.TCNT  bit masks and bit positions */
#define STYLUSCOMIFV2_TCNT_gm  0x3F  /* Transmit Counter group mask. */
#define STYLUSCOMIFV2_TCNT_gp  0  /* Transmit Counter group position. */
#define STYLUSCOMIFV2_TCNT0_bm  (1<<0)  /* Transmit Counter bit 0 mask. */
#define STYLUSCOMIFV2_TCNT0_bp  0  /* Transmit Counter bit 0 position. */
#define STYLUSCOMIFV2_TCNT1_bm  (1<<1)  /* Transmit Counter bit 1 mask. */
#define STYLUSCOMIFV2_TCNT1_bp  1  /* Transmit Counter bit 1 position. */
#define STYLUSCOMIFV2_TCNT2_bm  (1<<2)  /* Transmit Counter bit 2 mask. */
#define STYLUSCOMIFV2_TCNT2_bp  2  /* Transmit Counter bit 2 position. */
#define STYLUSCOMIFV2_TCNT3_bm  (1<<3)  /* Transmit Counter bit 3 mask. */
#define STYLUSCOMIFV2_TCNT3_bp  3  /* Transmit Counter bit 3 position. */
#define STYLUSCOMIFV2_TCNT4_bm  (1<<4)  /* Transmit Counter bit 4 mask. */
#define STYLUSCOMIFV2_TCNT4_bp  4  /* Transmit Counter bit 4 position. */
#define STYLUSCOMIFV2_TCNT5_bm  (1<<5)  /* Transmit Counter bit 5 mask. */
#define STYLUSCOMIFV2_TCNT5_bp  5  /* Transmit Counter bit 5 position. */

/* STYLUSCOMIFV2.TDLYINIT  bit masks and bit positions */
#define STYLUSCOMIFV2_DLYINIT_gm  0xFF  /* Delay Initial Value group mask. */
#define STYLUSCOMIFV2_DLYINIT_gp  0  /* Delay Initial Value group position. */
#define STYLUSCOMIFV2_DLYINIT0_bm  (1<<0)  /* Delay Initial Value bit 0 mask. */
#define STYLUSCOMIFV2_DLYINIT0_bp  0  /* Delay Initial Value bit 0 position. */
#define STYLUSCOMIFV2_DLYINIT1_bm  (1<<1)  /* Delay Initial Value bit 1 mask. */
#define STYLUSCOMIFV2_DLYINIT1_bp  1  /* Delay Initial Value bit 1 position. */
#define STYLUSCOMIFV2_DLYINIT2_bm  (1<<2)  /* Delay Initial Value bit 2 mask. */
#define STYLUSCOMIFV2_DLYINIT2_bp  2  /* Delay Initial Value bit 2 position. */
#define STYLUSCOMIFV2_DLYINIT3_bm  (1<<3)  /* Delay Initial Value bit 3 mask. */
#define STYLUSCOMIFV2_DLYINIT3_bp  3  /* Delay Initial Value bit 3 position. */
#define STYLUSCOMIFV2_DLYINIT4_bm  (1<<4)  /* Delay Initial Value bit 4 mask. */
#define STYLUSCOMIFV2_DLYINIT4_bp  4  /* Delay Initial Value bit 4 position. */
#define STYLUSCOMIFV2_DLYINIT5_bm  (1<<5)  /* Delay Initial Value bit 5 mask. */
#define STYLUSCOMIFV2_DLYINIT5_bp  5  /* Delay Initial Value bit 5 position. */
#define STYLUSCOMIFV2_DLYINIT6_bm  (1<<6)  /* Delay Initial Value bit 6 mask. */
#define STYLUSCOMIFV2_DLYINIT6_bp  6  /* Delay Initial Value bit 6 position. */
#define STYLUSCOMIFV2_DLYINIT7_bm  (1<<7)  /* Delay Initial Value bit 7 mask. */
#define STYLUSCOMIFV2_DLYINIT7_bp  7  /* Delay Initial Value bit 7 position. */

/* STYLUSCOMIFV2.TDLYCLAMP  bit masks and bit positions */
#define STYLUSCOMIFV2_DLYCLAMP_gm  0xFF  /* Delay Clamp for Receiver Clamp Tip group mask. */
#define STYLUSCOMIFV2_DLYCLAMP_gp  0  /* Delay Clamp for Receiver Clamp Tip group position. */
#define STYLUSCOMIFV2_DLYCLAMP0_bm  (1<<0)  /* Delay Clamp for Receiver Clamp Tip bit 0 mask. */
#define STYLUSCOMIFV2_DLYCLAMP0_bp  0  /* Delay Clamp for Receiver Clamp Tip bit 0 position. */
#define STYLUSCOMIFV2_DLYCLAMP1_bm  (1<<1)  /* Delay Clamp for Receiver Clamp Tip bit 1 mask. */
#define STYLUSCOMIFV2_DLYCLAMP1_bp  1  /* Delay Clamp for Receiver Clamp Tip bit 1 position. */
#define STYLUSCOMIFV2_DLYCLAMP2_bm  (1<<2)  /* Delay Clamp for Receiver Clamp Tip bit 2 mask. */
#define STYLUSCOMIFV2_DLYCLAMP2_bp  2  /* Delay Clamp for Receiver Clamp Tip bit 2 position. */
#define STYLUSCOMIFV2_DLYCLAMP3_bm  (1<<3)  /* Delay Clamp for Receiver Clamp Tip bit 3 mask. */
#define STYLUSCOMIFV2_DLYCLAMP3_bp  3  /* Delay Clamp for Receiver Clamp Tip bit 3 position. */
#define STYLUSCOMIFV2_DLYCLAMP4_bm  (1<<4)  /* Delay Clamp for Receiver Clamp Tip bit 4 mask. */
#define STYLUSCOMIFV2_DLYCLAMP4_bp  4  /* Delay Clamp for Receiver Clamp Tip bit 4 position. */
#define STYLUSCOMIFV2_DLYCLAMP5_bm  (1<<5)  /* Delay Clamp for Receiver Clamp Tip bit 5 mask. */
#define STYLUSCOMIFV2_DLYCLAMP5_bp  5  /* Delay Clamp for Receiver Clamp Tip bit 5 position. */
#define STYLUSCOMIFV2_DLYCLAMP6_bm  (1<<6)  /* Delay Clamp for Receiver Clamp Tip bit 6 mask. */
#define STYLUSCOMIFV2_DLYCLAMP6_bp  6  /* Delay Clamp for Receiver Clamp Tip bit 6 position. */
#define STYLUSCOMIFV2_DLYCLAMP7_bm  (1<<7)  /* Delay Clamp for Receiver Clamp Tip bit 7 mask. */
#define STYLUSCOMIFV2_DLYCLAMP7_bp  7  /* Delay Clamp for Receiver Clamp Tip bit 7 position. */

/* STYLUSCOMIFV2.TDLYRXDIS  bit masks and bit positions */
#define STYLUSCOMIFV2_DLYRXDIS_gm  0x0F  /* Transmit Delay for Receiver Disable group mask. */
#define STYLUSCOMIFV2_DLYRXDIS_gp  0  /* Transmit Delay for Receiver Disable group position. */
#define STYLUSCOMIFV2_DLYRXDIS0_bm  (1<<0)  /* Transmit Delay for Receiver Disable bit 0 mask. */
#define STYLUSCOMIFV2_DLYRXDIS0_bp  0  /* Transmit Delay for Receiver Disable bit 0 position. */
#define STYLUSCOMIFV2_DLYRXDIS1_bm  (1<<1)  /* Transmit Delay for Receiver Disable bit 1 mask. */
#define STYLUSCOMIFV2_DLYRXDIS1_bp  1  /* Transmit Delay for Receiver Disable bit 1 position. */
#define STYLUSCOMIFV2_DLYRXDIS2_bm  (1<<2)  /* Transmit Delay for Receiver Disable bit 2 mask. */
#define STYLUSCOMIFV2_DLYRXDIS2_bp  2  /* Transmit Delay for Receiver Disable bit 2 position. */
#define STYLUSCOMIFV2_DLYRXDIS3_bm  (1<<3)  /* Transmit Delay for Receiver Disable bit 3 mask. */
#define STYLUSCOMIFV2_DLYRXDIS3_bp  3  /* Transmit Delay for Receiver Disable bit 3 position. */

/* STYLUSCOMIFV2.TDLYCNT  bit masks and bit positions */
#define STYLUSCOMIFV2_DLYCNT_gm  0xFF  /* Transmit Delay Counter group mask. */
#define STYLUSCOMIFV2_DLYCNT_gp  0  /* Transmit Delay Counter group position. */
#define STYLUSCOMIFV2_DLYCNT0_bm  (1<<0)  /* Transmit Delay Counter bit 0 mask. */
#define STYLUSCOMIFV2_DLYCNT0_bp  0  /* Transmit Delay Counter bit 0 position. */
#define STYLUSCOMIFV2_DLYCNT1_bm  (1<<1)  /* Transmit Delay Counter bit 1 mask. */
#define STYLUSCOMIFV2_DLYCNT1_bp  1  /* Transmit Delay Counter bit 1 position. */
#define STYLUSCOMIFV2_DLYCNT2_bm  (1<<2)  /* Transmit Delay Counter bit 2 mask. */
#define STYLUSCOMIFV2_DLYCNT2_bp  2  /* Transmit Delay Counter bit 2 position. */
#define STYLUSCOMIFV2_DLYCNT3_bm  (1<<3)  /* Transmit Delay Counter bit 3 mask. */
#define STYLUSCOMIFV2_DLYCNT3_bp  3  /* Transmit Delay Counter bit 3 position. */
#define STYLUSCOMIFV2_DLYCNT4_bm  (1<<4)  /* Transmit Delay Counter bit 4 mask. */
#define STYLUSCOMIFV2_DLYCNT4_bp  4  /* Transmit Delay Counter bit 4 position. */
#define STYLUSCOMIFV2_DLYCNT5_bm  (1<<5)  /* Transmit Delay Counter bit 5 mask. */
#define STYLUSCOMIFV2_DLYCNT5_bp  5  /* Transmit Delay Counter bit 5 position. */
#define STYLUSCOMIFV2_DLYCNT6_bm  (1<<6)  /* Transmit Delay Counter bit 6 mask. */
#define STYLUSCOMIFV2_DLYCNT6_bp  6  /* Transmit Delay Counter bit 6 position. */
#define STYLUSCOMIFV2_DLYCNT7_bm  (1<<7)  /* Transmit Delay Counter bit 7 mask. */
#define STYLUSCOMIFV2_DLYCNT7_bp  7  /* Transmit Delay Counter bit 7 position. */

