gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* STYLUSCOMIFV2.TRCNT  bit masks and bit positions */
#define STYLUSCOMIFV2_TRCNT_gm  0x07  /* Transmit Repeat Counter group mask. */
#define STYLUSCOMIFV2_TRCNT_gp  0  /* Transmit Repeat Counter group position. */
#define STYLUSCOMIFV2_TRCNT0_bm  (1<<0)  /* Transmit Repeat Counter bit 0 mask. */
#define STYLUSCOMIFV2_TRCNT0_bp  0  /* Transmit Repeat Counter bit 0 position. */
#define STYLUSCOMIFV2_TRCNT1_bm  (1<<1)  /* Transmit Repeat Counter bit 1 mask. */
#define STYLUSCOMIFV2_TRCNT1_bp  1  /* Transmit Repeat Counter bit 1 position. */
#define STYLUSCOMIFV2_TRCNT2_bm  (1<<2)  /* Transmit Repeat Counter bit 2 mask. */
#define STYLUSCOMIFV2_TRCNT2_bp  2  /* Transmit Repeat Counter bit 2 position. */

/* STYLUSCOMIFV2.TXREP  bit masks and bit positions */
#define STYLUSCOMIFV2_TXREP_gm  0x07  /* Transmit Repeat Counter group mask. */
#define STYLUSCOMIFV2_TXREP_gp  0  /* Transmit Repeat Counter group position. */
#define STYLUSCOMIFV2_TXREP0_bm  (1<<0)  /* Transmit Repeat Counter bit 0 mask. */
#define STYLUSCOMIFV2_TXREP0_bp  0  /* Transmit Repeat Counter bit 0 position. */
#define STYLUSCOMIFV2_TXREP1_bm  (1<<1)  /* Transmit Repeat Counter bit 1 mask. */
#define STYLUSCOMIFV2_TXREP1_bp  1  /* Transmit Repeat Counter bit 1 position. */
#define STYLUSCOMIFV2_TXREP2_bm  (1<<2)  /* Transmit Repeat Counter bit 2 mask. */
#define STYLUSCOMIFV2_TXREP2_bp  2  /* Transmit Repeat Counter bit 2 position. */

/* STYLUSCOMIFV2.TXTIMCTRLA  bit masks and bit positions */
#define STYLUSCOMIFV2_CNTREAL_gm  0xFF  /* Count Real group mask. */
#define STYLUSCOMIFV2_CNTREAL_gp  0  /* Count Real group position. */
#define STYLUSCOMIFV2_CNTREAL0_bm  (1<<0)  /* Count Real bit 0 mask. */
#define STYLUSCOMIFV2_CNTREAL0_bp  0  /* Count Real bit 0 position. */
#define STYLUSCOMIFV2_CNTREAL1_bm  (1<<1)  /* Count Real bit 1 mask. */
#define STYLUSCOMIFV2_CNTREAL1_bp  1  /* Count Real bit 1 position. */
#define STYLUSCOMIFV2_CNTREAL2_bm  (1<<2)  /* Count Real bit 2 mask. */
#define STYLUSCOMIFV2_CNTREAL2_bp  2  /* Count Real bit 2 position. */
#define STYLUSCOMIFV2_CNTREAL3_bm  (1<<3)  /* Count Real bit 3 mask. */
#define STYLUSCOMIFV2_CNTREAL3_bp  3  /* Count Real bit 3 position. */
#define STYLUSCOMIFV2_CNTREAL4_bm  (1<<4)  /* Count Real bit 4 mask. */
#define STYLUSCOMIFV2_CNTREAL4_bp  4  /* Count Real bit 4 position. */
#define STYLUSCOMIFV2_CNTREAL5_bm  (1<<5)  /* Count Real bit 5 mask. */
#define STYLUSCOMIFV2_CNTREAL5_bp  5  /* Count Real bit 5 position. */
#define STYLUSCOMIFV2_CNTREAL6_bm  (1<<6)  /* Count Real bit 6 mask. */
#define STYLUSCOMIFV2_CNTREAL6_bp  6  /* Count Real bit 6 position. */
#define STYLUSCOMIFV2_CNTREAL7_bm  (1<<7)  /* Count Real bit 7 mask. */
#define STYLUSCOMIFV2_CNTREAL7_bp  7  /* Count Real bit 7 position. */

/* STYLUSCOMIFV2.TXTIMCTRLB  bit masks and bit positions */
#define STYLUSCOMIFV2_CNTFRACT_gm  0x7F  /* Count Fractional group mask. */
#define STYLUSCOMIFV2_CNTFRACT_gp  0  /* Count Fractional group position. */
#define STYLUSCOMIFV2_CNTFRACT0_bm  (1<<0)  /* Count Fractional bit 0 mask. */
#define STYLUSCOMIFV2_CNTFRACT0_bp  0  /* Count Fractional bit 0 position. */
#define STYLUSCOMIFV2_CNTFRACT1_bm  (1<<1)  /* Count Fractional bit 1 mask. */
#define STYLUSCOMIFV2_CNTFRACT1_bp  1  /* Count Fractional bit 1 position. */
#define STYLUSCOMIFV2_CNTFRACT2_bm  (1<<2)  /* Count Fractional bit 2 mask. */
#define STYLUSCOMIFV2_CNTFRACT2_bp  2  /* Count Fractional bit 2 position. */
#define STYLUSCOMIFV2_CNTFRACT3_bm  (1<<3)  /* Count Fractional bit 3 mask. */
#define STYLUSCOMIFV2_CNTFRACT3_bp  3  /* Count Fractional bit 3 position. */
#define STYLUSCOMIFV2_CNTFRACT4_bm  (1<<4)  /* Count Fractional bit 4 mask. */
#define STYLUSCOMIFV2_CNTFRACT4_bp  4  /* Count Fractional bit 4 position. */
#define STYLUSCOMIFV2_CNTFRACT5_bm  (1<<5)  /* Count Fractional bit 5 mask. */
#define STYLUSCOMIFV2_CNTFRACT5_bp  5  /* Count Fractional bit 5 position. */
#define STYLUSCOMIFV2_CNTFRACT6_bm  (1<<6)  /* Count Fractional bit 6 mask. */
#define STYLUSCOMIFV2_CNTFRACT6_bp  6  /* Count Fractional bit 6 position. */

/* STYLUSCOMIFV2.TXDATA0  bit masks and bit positions */
#define STYLUSCOMIFV2_TD0_gm  0xFF  /* Data 0 group mask. */
#define STYLUSCOMIFV2_TD0_gp  0  /* Data 0 group position. */
#define STYLUSCOMIFV2_TD00_bm  (1<<0)  /* Data 0 bit 0 mask. */
#define STYLUSCOMIFV2_TD00_bp  0  /* Data 0 bit 0 position. */
#define STYLUSCOMIFV2_TD01_bm  (1<<1)  /* Data 0 bit 1 mask. */
#define STYLUSCOMIFV2_TD01_bp  1  /* Data 0 bit 1 position. */
#define STYLUSCOMIFV2_TD02_bm  (1<<2)  /* Data 0 bit 2 mask. */
#define STYLUSCOMIFV2_TD02_bp  2  /* Data 0 bit 2 position. */
#define STYLUSCOMIFV2_TD03_bm  (1<<3)  /* Data 0 bit 3 mask. */
#define STYLUSCOMIFV2_TD03_bp  3  /* Data 0 bit 3 position. */
#define STYLUSCOMIFV2_TD04_bm  (1<<4)  /* Data 0 bit 4 mask. */
#define STYLUSCOMIFV2_TD04_bp  4  /* Data 0 bit 4 position. */
#define STYLUSCOMIFV2_TD05_bm  (1<<5)  /* Data 0 bit 5 mask. */
#define STYLUSCOMIFV2_TD05_bp  5  /* Data 0 bit 5 position. */
#define STYLUSCOMIFV2_TD06_bm  (1<<6)  /* Data 0 bit 6 mask. */
#define STYLUSCOMIFV2_TD06_bp  6  /* Data 0 bit 6 position. */
#define STYLUSCOMIFV2_TD07_bm  (1<<7)  /* Data 0 bit 7 mask. */
#define STYLUSCOMIFV2_TD07_bp  7  /* Data 0 bit 7 position. */

/* STYLUSCOMIFV2.TXDATA1  bit masks and bit positions */
#define STYLUSCOMIFV2_TD1_gm  0xFF  /* Data 1 group mask. */
#define STYLUSCOMIFV2_TD1_gp  0  /* Data 1 group position. */
#define STYLUSCOMIFV2_TD10_bm  (1<<0)  /* Data 1 bit 0 mask. */
#define STYLUSCOMIFV2_TD10_bp  0  /* Data 1 bit 0 position. */
#define STYLUSCOMIFV2_TD11_bm  (1<<1)  /* Data 1 bit 1 mask. */
#define STYLUSCOMIFV2_TD11_bp  1  /* Data 1 bit 1 position. */
#define STYLUSCOMIFV2_TD12_bm  (1<<2)  /* Data 1 bit 2 mask. */
#define STYLUSCOMIFV2_TD12_bp  2  /* Data 1 bit 2 position. */
#define STYLUSCOMIFV2_TD13_bm  (1<<3)  /* Data 1 bit 3 mask. */
#define STYLUSCOMIFV2_TD13_bp  3  /* Data 1 bit 3 position. */
#define STYLUSCOMIFV2_TD14_bm  (1<<4)  /* Data 1 bit 4 mask. */
#define STYLUSCOMIFV2_TD14_bp  4  /* Data 1 bit 4 position. */
#define STYLUSCOMIFV2_TD15_bm  (1<<5)  /* Data 1 bit 5 mask. */
#define STYLUSCOMIFV2_TD15_bp  5  /* Data 1 bit 5 position. */
#define STYLUSCOMIFV2_TD16_bm  (1<<6)  /* Data 1 bit 6 mask. */
#define STYLUSCOMIFV2_TD16_bp  6  /* Data 1 bit 6 position. */
#define STYLUSCOMIFV2_TD17_bm  (1<<7)  /* Data 1 bit 7 mask. */
#define STYLUSCOMIFV2_TD17_bp  7  /* Data 1 bit 7 position. */

/* STYLUSCOMIFV2.TXDATA2  bit masks and bit positions */
#define STYLUSCOMIFV2_TD2_gm  0xFF  /* Data 2 group mask. */
#define STYLUSCOMIFV2_TD2_gp  0  /* Data 2 group position. */
#define STYLUSCOMIFV2_TD20_bm  (1<<0)  /* Data 2 bit 0 mask. */
#define STYLUSCOMIFV2_TD20_bp  0  /* Data 2 bit 0 position. */
#define STYLUSCOMIFV2_TD21_bm  (1<<1)  /* Data 2 bit 1 mask. */
#define STYLUSCOMIFV2_TD21_bp  1  /* Data 2 bit 1 position. */
#define STYLUSCOMIFV2_TD22_bm  (1<<2)  /* Data 2 bit 2 mask. */
#define STYLUSCOMIFV2_TD22_bp  2  /* Data 2 bit 2 position. */
#define STYLUSCOMIFV2_TD23_bm  (1<<3)  /* Data 2 bit 3 mask. */
#define STYLUSCOMIFV2_TD23_bp  3  /* Data 2 bit 3 position. */
#define STYLUSCOMIFV2_TD24_bm  (1<<4)  /* Data 2 bit 4 mask. */
#define STYLUSCOMIFV2_TD24_bp  4  /* Data 2 bit 4 position. */
#define STYLUSCOMIFV2_TD25_bm  (1<<5)  /* Data 2 bit 5 mask. */
#define STYLUSCOMIFV2_TD25_bp  5  /* Data 2 bit 5 position. */
#define STYLUSCOMIFV2_TD26_bm  (1<<6)  /* Data 2 bit 6 mask. */
#define STYLUSCOMIFV2_TD26_bp  6  /* Data 2 bit 6 position. */
#define STYLUSCOMIFV2_TD27_bm  (1<<7)  /* Data 2 bit 7 mask. */
#define STYLUSCOMIFV2_TD27_bp  7  /* Data 2 bit 7 position. */

/* STYLUSCOMIFV2.TXDATA3  bit masks and bit positions */
#define STYLUSCOMIFV2_TD3_gm  0xFF  /* Data 3 group mask. */
#define STYLUSCOMIFV2_TD3_gp  0  /* Data 3 group position. */
#define STYLUSCOMIFV2_TD30_bm  (1<<0)  /* Data 3 bit 0 mask. */
#define STYLUSCOMIFV2_TD30_bp  0  /* Data 3 bit 0 position. */
#define STYLUSCOMIFV2_TD31_bm  (1<<1)  /* Data 3 bit 1 mask. */
#define STYLUSCOMIFV2_TD31_bp  1  /* Data 3 bit 1 position. */
#define STYLUSCOMIFV2_TD32_bm  (1<<2)  /* Data 3 bit 2 mask. */
#define STYLUSCOMIFV2_TD32_bp  2  /* Data 3 bit 2 position. */
#define STYLUSCOMIFV2_TD33_bm  (1<<3)  /* Data 3 bit 3 mask. */
#define STYLUSCOMIFV2_TD33_bp  3  /* Data 3 bit 3 position. */
#define STYLUSCOMIFV2_TD34_bm  (1<<4)  /* Data 3 bit 4 mask. */
#define STYLUSCOMIFV2_TD34_bp  4  /* Data 3 bit 4 position. */
#define STYLUSCOMIFV2_TD35_bm  (1<<5)  /* Data 3 bit 5 mask. */
#define STYLUSCOMIFV2_TD35_bp  5  /* Data 3 bit 5 position. */
#define STYLUSCOMIFV2_TD36_bm  (1<<6)  /* Data 3 bit 6 mask. */
#define STYLUSCOMIFV2_TD36_bp  6  /* Data 3 bit 6 position. */
#define STYLUSCOMIFV2_TD37_bm  (1<<7)  /* Data 3 bit 7 mask. */
#define STYLUSCOMIFV2_TD37_bp  7  /* Data 3 bit 7 position. */

/* STYLUSCOMIFV2.TXDATA4  bit masks and bit positions */
#define STYLUSCOMIFV2_TD4_gm  0xFF  /* Data 4 group mask. */
#define STYLUSCOMIFV2_TD4_gp  0  /* Data 4 group position. */
#define STYLUSCOMIFV2_TD40_bm  (1<<0)  /* Data 4 bit 0 mask. */
#define STYLUSCOMIFV2_TD40_bp  0  /* Data 4 bit 0 position. */
#define STYLUSCOMIFV2_TD41_bm  (1<<1)  /* Data 4 bit 1 mask. */
#define STYLUSCOMIFV2_TD41_bp  1  /* Data 4 bit 1 position. */
#define STYLUSCOMIFV2_TD42_bm  (1<<2)  /* Data 4 bit 2 mask. */
#define STYLUSCOMIFV2_TD42_bp  2  /* Data 4 bit 2 position. */
#define STYLUSCOMIFV2_TD43_bm  (1<<3)  /* Data 4 bit 3 mask. */
#define STYLUSCOMIFV2_TD43_bp  3  /* Data 4 bit 3 position. */
#define STYLUSCOMIFV2_TD44_bm  (1<<4)  /* Data 4 bit 4 mask. */
#define STYLUSCOMIFV2_TD44_bp  4  /* Data 4 bit 4 position. */
#define STYLUSCOMIFV2_TD45_bm  (1<<5)  /* Data 4 bit 5 mask. */
#define STYLUSCOMIFV2_TD45_bp  5  /* Data 4 bit 5 position. */
#define STYLUSCOMIFV2_TD46_bm  (1<<6)  /* Data 4 bit 6 mask. */
#define STYLUSCOMIFV2_TD46_bp  6  /* Data 4 bit 6 position. */
#define STYLUSCOMIFV2_TD47_bm  (1<<7)  /* Data 4 bit 7 mask. */
#define STYLUSCOMIFV2_TD47_bp  7  /* Data 4 bit 7 position. */

