gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* STYLUSCOMIFV2.TXDATA5  bit masks and bit positions */
#define STYLUSCOMIFV2_TD5_gm  0xFF  /* Data 5 group mask. */
#define STYLUSCOMIFV2_TD5_gp  0  /* Data 5 group position. */
#define STYLUSCOMIFV2_TD50_bm  (1<<0)  /* Data 5 bit 0 mask. */
#define STYLUSCOMIFV2_TD50_bp  0  /* Data 5 bit 0 position. */
#define STYLUSCOMIFV2_TD51_bm  (1<<1)  /* Data 5 bit 1 mask. */
#define STYLUSCOMIFV2_TD51_bp  1  /* Data 5 bit 1 position. */
#define STYLUSCOMIFV2_TD52_bm  (1<<2)  /* Data 5 bit 2 mask. */
#define STYLUSCOMIFV2_TD52_bp  2  /* Data 5 bit 2 position. */
#define STYLUSCOMIFV2_TD53_bm  (1<<3)  /* Data 5 bit 3 mask. */
#define STYLUSCOMIFV2_TD53_bp  3  /* Data 5 bit 3 position. */
#define STYLUSCOMIFV2_TD54_bm  (1<<4)  /* Data 5 bit 4 mask. */
#define STYLUSCOMIFV2_TD54_bp  4  /* Data 5 bit 4 position. */
#define STYLUSCOMIFV2_TD55_bm  (1<<5)  /* Data 5 bit 5 mask. */
#define STYLUSCOMIFV2_TD55_bp  5  /* Data 5 bit 5 position. */
#define STYLUSCOMIFV2_TD56_bm  (1<<6)  /* Data 5 bit 6 mask. */
#define STYLUSCOMIFV2_TD56_bp  6  /* Data 5 bit 6 position. */
#define STYLUSCOMIFV2_TD57_bm  (1<<7)  /* Data 5 bit 7 mask. */
#define STYLUSCOMIFV2_TD57_bp  7  /* Data 5 bit 7 position. */

/* STYLUSCOMIFV2.TXDATA6  bit masks and bit positions */
#define STYLUSCOMIFV2_TD6_gm  0xFF  /* Data 6 group mask. */
#define STYLUSCOMIFV2_TD6_gp  0  /* Data 6 group position. */
#define STYLUSCOMIFV2_TD60_bm  (1<<0)  /* Data 6 bit 0 mask. */
#define STYLUSCOMIFV2_TD60_bp  0  /* Data 6 bit 0 position. */
#define STYLUSCOMIFV2_TD61_bm  (1<<1)  /* Data 6 bit 1 mask. */
#define STYLUSCOMIFV2_TD61_bp  1  /* Data 6 bit 1 position. */
#define STYLUSCOMIFV2_TD62_bm  (1<<2)  /* Data 6 bit 2 mask. */
#define STYLUSCOMIFV2_TD62_bp  2  /* Data 6 bit 2 position. */
#define STYLUSCOMIFV2_TD63_bm  (1<<3)  /* Data 6 bit 3 mask. */
#define STYLUSCOMIFV2_TD63_bp  3  /* Data 6 bit 3 position. */
#define STYLUSCOMIFV2_TD64_bm  (1<<4)  /* Data 6 bit 4 mask. */
#define STYLUSCOMIFV2_TD64_bp  4  /* Data 6 bit 4 position. */
#define STYLUSCOMIFV2_TD65_bm  (1<<5)  /* Data 6 bit 5 mask. */
#define STYLUSCOMIFV2_TD65_bp  5  /* Data 6 bit 5 position. */
#define STYLUSCOMIFV2_TD66_bm  (1<<6)  /* Data 6 bit 6 mask. */
#define STYLUSCOMIFV2_TD66_bp  6  /* Data 6 bit 6 position. */
#define STYLUSCOMIFV2_TD67_bm  (1<<7)  /* Data 6 bit 7 mask. */
#define STYLUSCOMIFV2_TD67_bp  7  /* Data 6 bit 7 position. */

/* STYLUSCOMIFV2.TXDATA7  bit masks and bit positions */
#define STYLUSCOMIFV2_TD7_gm  0xFF  /* Data 7 group mask. */
#define STYLUSCOMIFV2_TD7_gp  0  /* Data 7 group position. */
#define STYLUSCOMIFV2_TD70_bm  (1<<0)  /* Data 7 bit 0 mask. */
#define STYLUSCOMIFV2_TD70_bp  0  /* Data 7 bit 0 position. */
#define STYLUSCOMIFV2_TD71_bm  (1<<1)  /* Data 7 bit 1 mask. */
#define STYLUSCOMIFV2_TD71_bp  1  /* Data 7 bit 1 position. */
#define STYLUSCOMIFV2_TD72_bm  (1<<2)  /* Data 7 bit 2 mask. */
#define STYLUSCOMIFV2_TD72_bp  2  /* Data 7 bit 2 position. */
#define STYLUSCOMIFV2_TD73_bm  (1<<3)  /* Data 7 bit 3 mask. */
#define STYLUSCOMIFV2_TD73_bp  3  /* Data 7 bit 3 position. */
#define STYLUSCOMIFV2_TD74_bm  (1<<4)  /* Data 7 bit 4 mask. */
#define STYLUSCOMIFV2_TD74_bp  4  /* Data 7 bit 4 position. */
#define STYLUSCOMIFV2_TD75_bm  (1<<5)  /* Data 7 bit 5 mask. */
#define STYLUSCOMIFV2_TD75_bp  5  /* Data 7 bit 5 position. */
#define STYLUSCOMIFV2_TD76_bm  (1<<6)  /* Data 7 bit 6 mask. */
#define STYLUSCOMIFV2_TD76_bp  6  /* Data 7 bit 6 position. */
#define STYLUSCOMIFV2_TD77_bm  (1<<7)  /* Data 7 bit 7 mask. */
#define STYLUSCOMIFV2_TD77_bp  7  /* Data 7 bit 7 position. */

/* STYLUSCOMIFV2.TX_STROBE  bit masks and bit positions */
#define STYLUSCOMIFV2_NEDOS_bm  0x01  /* Negative Edge Detect Override Strobe bit mask. */
#define STYLUSCOMIFV2_NEDOS_bp  0  /* Negative Edge Detect Override Strobe bit position. */
#define STYLUSCOMIFV2_PEDOS_bm  0x02  /* Positive Edge Detect Override Strobe bit mask. */
#define STYLUSCOMIFV2_PEDOS_bp  1  /* Positive Edge Detect Override Strobe bit position. */
#define STYLUSCOMIFV2_AFOS_bm  0x04  /* Abort Frame Override Strobe bit mask. */
#define STYLUSCOMIFV2_AFOS_bp  2  /* Abort Frame Override Strobe bit position. */
#define STYLUSCOMIFV2_GOTX_bm  0x08  /* Go TX bit mask. */
#define STYLUSCOMIFV2_GOTX_bp  3  /* Go TX bit position. */

/* STYLUSCOMIFV2.INTCTRLA  bit masks and bit positions */
#define STYLUSCOMIFV2_AHINTLVL_gm  0x03  /* Abort Header Interrupt Level group mask. */
#define STYLUSCOMIFV2_AHINTLVL_gp  0  /* Abort Header Interrupt Level group position. */
#define STYLUSCOMIFV2_AHINTLVL0_bm  (1<<0)  /* Abort Header Interrupt Level bit 0 mask. */
#define STYLUSCOMIFV2_AHINTLVL0_bp  0  /* Abort Header Interrupt Level bit 0 position. */
#define STYLUSCOMIFV2_AHINTLVL1_bm  (1<<1)  /* Abort Header Interrupt Level bit 1 mask. */
#define STYLUSCOMIFV2_AHINTLVL1_bp  1  /* Abort Header Interrupt Level bit 1 position. */
#define STYLUSCOMIFV2_ADINTLVL_gm  0x0C  /* Abort Data Interrupt Level group mask. */
#define STYLUSCOMIFV2_ADINTLVL_gp  2  /* Abort Data Interrupt Level group position. */
#define STYLUSCOMIFV2_ADINTLVL0_bm  (1<<2)  /* Abort Data Interrupt Level bit 0 mask. */
#define STYLUSCOMIFV2_ADINTLVL0_bp  2  /* Abort Data Interrupt Level bit 0 position. */
#define STYLUSCOMIFV2_ADINTLVL1_bm  (1<<3)  /* Abort Data Interrupt Level bit 1 mask. */
#define STYLUSCOMIFV2_ADINTLVL1_bp  3  /* Abort Data Interrupt Level bit 1 position. */
#define STYLUSCOMIFV2_EHINTLVL_gm  0x30  /* End of Header Interrupt Level group mask. */
#define STYLUSCOMIFV2_EHINTLVL_gp  4  /* End of Header Interrupt Level group position. */
#define STYLUSCOMIFV2_EHINTLVL0_bm  (1<<4)  /* End of Header Interrupt Level bit 0 mask. */
#define STYLUSCOMIFV2_EHINTLVL0_bp  4  /* End of Header Interrupt Level bit 0 position. */
#define STYLUSCOMIFV2_EHINTLVL1_bm  (1<<5)  /* End of Header Interrupt Level bit 1 mask. */
#define STYLUSCOMIFV2_EHINTLVL1_bp  5  /* End of Header Interrupt Level bit 1 position. */
#define STYLUSCOMIFV2_SHINTLVL_gm  0xC0  /* Start of Header Interrupt Level group mask. */
#define STYLUSCOMIFV2_SHINTLVL_gp  6  /* Start of Header Interrupt Level group position. */
#define STYLUSCOMIFV2_SHINTLVL0_bm  (1<<6)  /* Start of Header Interrupt Level bit 0 mask. */
#define STYLUSCOMIFV2_SHINTLVL0_bp  6  /* Start of Header Interrupt Level bit 0 position. */
#define STYLUSCOMIFV2_SHINTLVL1_bm  (1<<7)  /* Start of Header Interrupt Level bit 1 mask. */
#define STYLUSCOMIFV2_SHINTLVL1_bp  7  /* Start of Header Interrupt Level bit 1 position. */

