gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* STYLUSCOMIFV2.INTCTRLB  bit masks and bit positions */
#define STYLUSCOMIFV2_FREQINTLVL_gm  0x03  /* Frequency Interrupt Level group mask. */
#define STYLUSCOMIFV2_FREQINTLVL_gp  0  /* Frequency Interrupt Level group position. */
#define STYLUSCOMIFV2_FREQINTLVL0_bm  (1<<0)  /* Frequency Interrupt Level bit 0 mask. */
#define STYLUSCOMIFV2_FREQINTLVL0_bp  0  /* Frequency Interrupt Level bit 0 position. */
#define STYLUSCOMIFV2_FREQINTLVL1_bm  (1<<1)  /* Frequency Interrupt Level bit 1 mask. */
#define STYLUSCOMIFV2_FREQINTLVL1_bp  1  /* Frequency Interrupt Level bit 1 position. */
#define STYLUSCOMIFV2_WAKEINTLVL_gm  0x0C  /* Wakeup Interrupt Level group mask. */
#define STYLUSCOMIFV2_WAKEINTLVL_gp  2  /* Wakeup Interrupt Level group position. */
#define STYLUSCOMIFV2_WAKEINTLVL0_bm  (1<<2)  /* Wakeup Interrupt Level bit 0 mask. */
#define STYLUSCOMIFV2_WAKEINTLVL0_bp  2  /* Wakeup Interrupt Level bit 0 position. */
#define STYLUSCOMIFV2_WAKEINTLVL1_bm  (1<<3)  /* Wakeup Interrupt Level bit 1 mask. */
#define STYLUSCOMIFV2_WAKEINTLVL1_bp  3  /* Wakeup Interrupt Level bit 1 position. */
#define STYLUSCOMIFV2_DCINTLVL_gm  0x30  /* DC Interrupt Level group mask. */
#define STYLUSCOMIFV2_DCINTLVL_gp  4  /* DC Interrupt Level group position. */
#define STYLUSCOMIFV2_DCINTLVL0_bm  (1<<4)  /* DC Interrupt Level bit 0 mask. */
#define STYLUSCOMIFV2_DCINTLVL0_bp  4  /* DC Interrupt Level bit 0 position. */
#define STYLUSCOMIFV2_DCINTLVL1_bm  (1<<5)  /* DC Interrupt Level bit 1 mask. */
#define STYLUSCOMIFV2_DCINTLVL1_bp  5  /* DC Interrupt Level bit 1 position. */

/* STYLUSCOMIFV2.INTCTRLC  bit masks and bit positions */
#define STYLUSCOMIFV2_FREQCNTSEL_gm  0x03  /* Frequency count Select group mask. */
#define STYLUSCOMIFV2_FREQCNTSEL_gp  0  /* Frequency count Select group position. */
#define STYLUSCOMIFV2_FREQCNTSEL0_bm  (1<<0)  /* Frequency count Select bit 0 mask. */
#define STYLUSCOMIFV2_FREQCNTSEL0_bp  0  /* Frequency count Select bit 0 position. */
#define STYLUSCOMIFV2_FREQCNTSEL1_bm  (1<<1)  /* Frequency count Select bit 1 mask. */
#define STYLUSCOMIFV2_FREQCNTSEL1_bp  1  /* Frequency count Select bit 1 position. */

/* STYLUSCOMIFV2.INTFLAGS  bit masks and bit positions */
#define STYLUSCOMIFV2_AHIF_bm  0x01  /* Abort Header Interrupt Flag bit mask. */
#define STYLUSCOMIFV2_AHIF_bp  0  /* Abort Header Interrupt Flag bit position. */
#define STYLUSCOMIFV2_ADIF_bm  0x02  /* Abort Data Interrupt Flag bit mask. */
#define STYLUSCOMIFV2_ADIF_bp  1  /* Abort Data Interrupt Flag bit position. */
#define STYLUSCOMIFV2_EHIF_bm  0x04  /* End of Header Interrupt Flag bit mask. */
#define STYLUSCOMIFV2_EHIF_bp  2  /* End of Header Interrupt Flag bit position. */
#define STYLUSCOMIFV2_SHIF_bm  0x08  /* Start of Header Interrupt Flag bit mask. */
#define STYLUSCOMIFV2_SHIF_bp  3  /* Start of Header Interrupt Flag bit position. */
#define STYLUSCOMIFV2_WAKEIF_bm  0x20  /* Wakeup Interrupt Flag bit mask. */
#define STYLUSCOMIFV2_WAKEIF_bp  5  /* Wakeup Interrupt Flag bit position. */
#define STYLUSCOMIFV2_DCIF_bm  0x40  /* DC Interrupt Flag bit mask. */
#define STYLUSCOMIFV2_DCIF_bp  6  /* DC Interrupt Flag bit position. */

/* STYLUSCOMIFV2.INTFLAG_FREQ  bit masks and bit positions */
#define STYLUSCOMIFV2_FREQIFDLY0_bm  0x01  /* Frequency Interrupt Flag delay line 0 bit mask. */
#define STYLUSCOMIFV2_FREQIFDLY0_bp  0  /* Frequency Interrupt Flag delay line 0 bit position. */
#define STYLUSCOMIFV2_FREQIFDLY1_bm  0x02  /* Frequency Interrupt Flag delay line 1 bit mask. */
#define STYLUSCOMIFV2_FREQIFDLY1_bp  1  /* Frequency Interrupt Flag delay line 1 bit position. */
#define STYLUSCOMIFV2_FREQIFDLY2_bm  0x04  /* Frequency Interrupt Flag delay line 2 bit mask. */
#define STYLUSCOMIFV2_FREQIFDLY2_bp  2  /* Frequency Interrupt Flag delay line 2 bit position. */

/* STYLUSCOMIFV2.STATUS  bit masks and bit positions */
#define STYLUSCOMIFV2_LEACC_bm  0x08  /* Last edge ok accumulator bit mask. */
#define STYLUSCOMIFV2_LEACC_bp  3  /* Last edge ok accumulator bit position. */
#define STYLUSCOMIFV2_LEFDIV_bm  0x10  /* Last edge ok fractional divition bit mask. */
#define STYLUSCOMIFV2_LEFDIV_bp  4  /* Last edge ok fractional divition bit position. */
#define STYLUSCOMIFV2_WAKE_SBSY_bm  0x40  /* Wakeup SBSY bit mask. */
#define STYLUSCOMIFV2_WAKE_SBSY_bp  6  /* Wakeup SBSY bit position. */
#define STYLUSCOMIFV2_ANABUSY_bm  0x80  /* Analog Startup Busy bit mask. */
#define STYLUSCOMIFV2_ANABUSY_bp  7  /* Analog Startup Busy bit position. */

/* STYLUSCOMIFV2.WAKE_CTRLA  bit masks and bit positions */
#define STYLUSCOMIFV2_DUTYONSEL_gm  0x07  /* Duty Window On Time Select group mask. */
#define STYLUSCOMIFV2_DUTYONSEL_gp  0  /* Duty Window On Time Select group position. */
#define STYLUSCOMIFV2_DUTYONSEL0_bm  (1<<0)  /* Duty Window On Time Select bit 0 mask. */
#define STYLUSCOMIFV2_DUTYONSEL0_bp  0  /* Duty Window On Time Select bit 0 position. */
#define STYLUSCOMIFV2_DUTYONSEL1_bm  (1<<1)  /* Duty Window On Time Select bit 1 mask. */
#define STYLUSCOMIFV2_DUTYONSEL1_bp  1  /* Duty Window On Time Select bit 1 position. */
#define STYLUSCOMIFV2_DUTYONSEL2_bm  (1<<2)  /* Duty Window On Time Select bit 2 mask. */
#define STYLUSCOMIFV2_DUTYONSEL2_bp  2  /* Duty Window On Time Select bit 2 position. */
#define STYLUSCOMIFV2_DUTYTOTSEL_gm  0x70  /* Duty Window Total Select group mask. */
#define STYLUSCOMIFV2_DUTYTOTSEL_gp  4  /* Duty Window Total Select group position. */
#define STYLUSCOMIFV2_DUTYTOTSEL0_bm  (1<<4)  /* Duty Window Total Select bit 0 mask. */
#define STYLUSCOMIFV2_DUTYTOTSEL0_bp  4  /* Duty Window Total Select bit 0 position. */
#define STYLUSCOMIFV2_DUTYTOTSEL1_bm  (1<<5)  /* Duty Window Total Select bit 1 mask. */
#define STYLUSCOMIFV2_DUTYTOTSEL1_bp  5  /* Duty Window Total Select bit 1 position. */
#define STYLUSCOMIFV2_DUTYTOTSEL2_bm  (1<<6)  /* Duty Window Total Select bit 2 mask. */
#define STYLUSCOMIFV2_DUTYTOTSEL2_bp  6  /* Duty Window Total Select bit 2 position. */

/* STYLUSCOMIFV2.WAKE_CTRLB  bit masks and bit positions */
#define STYLUSCOMIFV2_MEASONSEL_gm  0x07  /* Measure On Time Select group mask. */
#define STYLUSCOMIFV2_MEASONSEL_gp  0  /* Measure On Time Select group position. */
#define STYLUSCOMIFV2_MEASONSEL0_bm  (1<<0)  /* Measure On Time Select bit 0 mask. */
#define STYLUSCOMIFV2_MEASONSEL0_bp  0  /* Measure On Time Select bit 0 position. */
#define STYLUSCOMIFV2_MEASONSEL1_bm  (1<<1)  /* Measure On Time Select bit 1 mask. */
#define STYLUSCOMIFV2_MEASONSEL1_bp  1  /* Measure On Time Select bit 1 position. */
#define STYLUSCOMIFV2_MEASONSEL2_bm  (1<<2)  /* Measure On Time Select bit 2 mask. */
#define STYLUSCOMIFV2_MEASONSEL2_bp  2  /* Measure On Time Select bit 2 position. */

/* STYLUSCOMIFV2.WAKE_CTRLC  bit masks and bit positions */
#define STYLUSCOMIFV2_MEASOFFSEL_gm  0x3F  /* Measure Off Time Select group mask. */
#define STYLUSCOMIFV2_MEASOFFSEL_gp  0  /* Measure Off Time Select group position. */
#define STYLUSCOMIFV2_MEASOFFSEL0_bm  (1<<0)  /* Measure Off Time Select bit 0 mask. */
#define STYLUSCOMIFV2_MEASOFFSEL0_bp  0  /* Measure Off Time Select bit 0 position. */
#define STYLUSCOMIFV2_MEASOFFSEL1_bm  (1<<1)  /* Measure Off Time Select bit 1 mask. */
#define STYLUSCOMIFV2_MEASOFFSEL1_bp  1  /* Measure Off Time Select bit 1 position. */
#define STYLUSCOMIFV2_MEASOFFSEL2_bm  (1<<2)  /* Measure Off Time Select bit 2 mask. */
#define STYLUSCOMIFV2_MEASOFFSEL2_bp  2  /* Measure Off Time Select bit 2 position. */
#define STYLUSCOMIFV2_MEASOFFSEL3_bm  (1<<3)  /* Measure Off Time Select bit 3 mask. */
#define STYLUSCOMIFV2_MEASOFFSEL3_bp  3  /* Measure Off Time Select bit 3 position. */
#define STYLUSCOMIFV2_MEASOFFSEL4_bm  (1<<4)  /* Measure Off Time Select bit 4 mask. */
#define STYLUSCOMIFV2_MEASOFFSEL4_bp  4  /* Measure Off Time Select bit 4 position. */
#define STYLUSCOMIFV2_MEASOFFSEL5_bm  (1<<5)  /* Measure Off Time Select bit 5 mask. */
#define STYLUSCOMIFV2_MEASOFFSEL5_bp  5  /* Measure Off Time Select bit 5 position. */

