gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220e.h
/* STYLUSCOMIFV2.WAKE_CTRLD  bit masks and bit positions */
#define STYLUSCOMIFV2_THRESNEG_gm  0x07  /* Threshold Negative Edges group mask. */
#define STYLUSCOMIFV2_THRESNEG_gp  0  /* Threshold Negative Edges group position. */
#define STYLUSCOMIFV2_THRESNEG0_bm  (1<<0)  /* Threshold Negative Edges bit 0 mask. */
#define STYLUSCOMIFV2_THRESNEG0_bp  0  /* Threshold Negative Edges bit 0 position. */
#define STYLUSCOMIFV2_THRESNEG1_bm  (1<<1)  /* Threshold Negative Edges bit 1 mask. */
#define STYLUSCOMIFV2_THRESNEG1_bp  1  /* Threshold Negative Edges bit 1 position. */
#define STYLUSCOMIFV2_THRESNEG2_bm  (1<<2)  /* Threshold Negative Edges bit 2 mask. */
#define STYLUSCOMIFV2_THRESNEG2_bp  2  /* Threshold Negative Edges bit 2 position. */
#define STYLUSCOMIFV2_THRESPOS_gm  0x70  /* Threshold Positive Edges group mask. */
#define STYLUSCOMIFV2_THRESPOS_gp  4  /* Threshold Positive Edges group position. */
#define STYLUSCOMIFV2_THRESPOS0_bm  (1<<4)  /* Threshold Positive Edges bit 0 mask. */
#define STYLUSCOMIFV2_THRESPOS0_bp  4  /* Threshold Positive Edges bit 0 position. */
#define STYLUSCOMIFV2_THRESPOS1_bm  (1<<5)  /* Threshold Positive Edges bit 1 mask. */
#define STYLUSCOMIFV2_THRESPOS1_bp  5  /* Threshold Positive Edges bit 1 position. */
#define STYLUSCOMIFV2_THRESPOS2_bm  (1<<6)  /* Threshold Positive Edges bit 2 mask. */
#define STYLUSCOMIFV2_THRESPOS2_bp  6  /* Threshold Positive Edges bit 2 position. */

/* STYLUSCOMIFV2.TX_SOURCE  bit masks and bit positions */
#define STYLUSCOMIFV2_TX_SOURCE_SEL_gm  0x07  /* TX source select group mask. */
#define STYLUSCOMIFV2_TX_SOURCE_SEL_gp  0  /* TX source select group position. */
#define STYLUSCOMIFV2_TX_SOURCE_SEL0_bm  (1<<0)  /* TX source select bit 0 mask. */
#define STYLUSCOMIFV2_TX_SOURCE_SEL0_bp  0  /* TX source select bit 0 position. */
#define STYLUSCOMIFV2_TX_SOURCE_SEL1_bm  (1<<1)  /* TX source select bit 1 mask. */
#define STYLUSCOMIFV2_TX_SOURCE_SEL1_bp  1  /* TX source select bit 1 position. */
#define STYLUSCOMIFV2_TX_SOURCE_SEL2_bm  (1<<2)  /* TX source select bit 2 mask. */
#define STYLUSCOMIFV2_TX_SOURCE_SEL2_bp  2  /* TX source select bit 2 position. */

/* STYLUSCOMIFV2.ANA_SAT_CTRL  bit masks and bit positions */
#define STYLUSCOMIFV2_SAT_SYNCMODE_EN_bm  0x01  /* Saturation sync mode enable bit mask. */
#define STYLUSCOMIFV2_SAT_SYNCMODE_EN_bp  0  /* Saturation sync mode enable bit position. */
#define STYLUSCOMIFV2_SAT_SYNC_SEL_gm  0x1E  /* Saturation sync delay select group mask. */
#define STYLUSCOMIFV2_SAT_SYNC_SEL_gp  1  /* Saturation sync delay select group position. */
#define STYLUSCOMIFV2_SAT_SYNC_SEL0_bm  (1<<1)  /* Saturation sync delay select bit 0 mask. */
#define STYLUSCOMIFV2_SAT_SYNC_SEL0_bp  1  /* Saturation sync delay select bit 0 position. */
#define STYLUSCOMIFV2_SAT_SYNC_SEL1_bm  (1<<2)  /* Saturation sync delay select bit 1 mask. */
#define STYLUSCOMIFV2_SAT_SYNC_SEL1_bp  2  /* Saturation sync delay select bit 1 position. */
#define STYLUSCOMIFV2_SAT_SYNC_SEL2_bm  (1<<3)  /* Saturation sync delay select bit 2 mask. */
#define STYLUSCOMIFV2_SAT_SYNC_SEL2_bp  3  /* Saturation sync delay select bit 2 position. */
#define STYLUSCOMIFV2_SAT_SYNC_SEL3_bm  (1<<4)  /* Saturation sync delay select bit 3 mask. */
#define STYLUSCOMIFV2_SAT_SYNC_SEL3_bp  4  /* Saturation sync delay select bit 3 position. */
#define STYLUSCOMIFV2_SAT_SYNC_RST_INC_bm  0x20  /* Analog saturation increase analog reset time bit mask. */
#define STYLUSCOMIFV2_SAT_SYNC_RST_INC_bp  5  /* Analog saturation increase analog reset time bit position. */
#define STYLUSCOMIFV2_SAT_SYNC_LRST_INC_bm  0x40  /* Analog saturation increase latch reset time bit mask. */
#define STYLUSCOMIFV2_SAT_SYNC_LRST_INC_bp  6  /* Analog saturation increase latch reset time bit position. */

/* STYLUSCOMIFV2.TEMP  bit masks and bit positions */
#define STYLUSCOMIFV2_TEMP_gm  0xFF  /* Temporary Register group mask. */
#define STYLUSCOMIFV2_TEMP_gp  0  /* Temporary Register group position. */
#define STYLUSCOMIFV2_TEMP0_bm  (1<<0)  /* Temporary Register bit 0 mask. */
#define STYLUSCOMIFV2_TEMP0_bp  0  /* Temporary Register bit 0 position. */
#define STYLUSCOMIFV2_TEMP1_bm  (1<<1)  /* Temporary Register bit 1 mask. */
#define STYLUSCOMIFV2_TEMP1_bp  1  /* Temporary Register bit 1 position. */
#define STYLUSCOMIFV2_TEMP2_bm  (1<<2)  /* Temporary Register bit 2 mask. */
#define STYLUSCOMIFV2_TEMP2_bp  2  /* Temporary Register bit 2 position. */
#define STYLUSCOMIFV2_TEMP3_bm  (1<<3)  /* Temporary Register bit 3 mask. */
#define STYLUSCOMIFV2_TEMP3_bp  3  /* Temporary Register bit 3 position. */
#define STYLUSCOMIFV2_TEMP4_bm  (1<<4)  /* Temporary Register bit 4 mask. */
#define STYLUSCOMIFV2_TEMP4_bp  4  /* Temporary Register bit 4 position. */
#define STYLUSCOMIFV2_TEMP5_bm  (1<<5)  /* Temporary Register bit 5 mask. */
#define STYLUSCOMIFV2_TEMP5_bp  5  /* Temporary Register bit 5 position. */
#define STYLUSCOMIFV2_TEMP6_bm  (1<<6)  /* Temporary Register bit 6 mask. */
#define STYLUSCOMIFV2_TEMP6_bp  6  /* Temporary Register bit 6 position. */
#define STYLUSCOMIFV2_TEMP7_bm  (1<<7)  /* Temporary Register bit 7 mask. */
#define STYLUSCOMIFV2_TEMP7_bp  7  /* Temporary Register bit 7 position. */

/* TIM8_16 - Timer 8/16 bit */
/* TIM8_16.CTRLA  bit masks and bit positions */
#define TIM8_16_CTC_bm  0x01  /* Clear Timer on Compare Match Mode bit mask. */
#define TIM8_16_CTC_bp  0  /* Clear Timer on Compare Match Mode bit position. */
#define TIM8_16_ICES_bm  0x10  /* Input Capture Edge Select bit mask. */
#define TIM8_16_ICES_bp  4  /* Input Capture Edge Select bit position. */
#define TIM8_16_ICNC_bm  0x20  /* Input Capture Noise Canceller bit mask. */
#define TIM8_16_ICNC_bp  5  /* Input Capture Noise Canceller bit position. */
#define TIM8_16_ICEN_bm  0x40  /* Input Capture Mode Enable bit mask. */
#define TIM8_16_ICEN_bp  6  /* Input Capture Mode Enable bit position. */
#define TIM8_16_WORDM_bm  0x80  /* Word (16-bit) Mode bit mask. */
#define TIM8_16_WORDM_bp  7  /* Word (16-bit) Mode bit position. */

/* TIM8_16.CTRLB  bit masks and bit positions */
#define TIM8_16_CS_gm  0x0F  /* Clock Select group mask. */
#define TIM8_16_CS_gp  0  /* Clock Select group position. */
#define TIM8_16_CS0_bm  (1<<0)  /* Clock Select bit 0 mask. */
#define TIM8_16_CS0_bp  0  /* Clock Select bit 0 position. */
#define TIM8_16_CS1_bm  (1<<1)  /* Clock Select bit 1 mask. */
#define TIM8_16_CS1_bp  1  /* Clock Select bit 1 position. */
#define TIM8_16_CS2_bm  (1<<2)  /* Clock Select bit 2 mask. */
#define TIM8_16_CS2_bp  2  /* Clock Select bit 2 position. */
#define TIM8_16_CS3_bm  (1<<3)  /* Clock Select bit 3 mask. */
#define TIM8_16_CS3_bp  3  /* Clock Select bit 3 position. */
#define TIM8_16_ICS_gm  0x70  /* Input Capture Select group mask. */
#define TIM8_16_ICS_gp  4  /* Input Capture Select group position. */
#define TIM8_16_ICS0_bm  (1<<4)  /* Input Capture Select bit 0 mask. */
#define TIM8_16_ICS0_bp  4  /* Input Capture Select bit 0 position. */
#define TIM8_16_ICS1_bm  (1<<5)  /* Input Capture Select bit 1 mask. */
#define TIM8_16_ICS1_bp  5  /* Input Capture Select bit 1 position. */
#define TIM8_16_ICS2_bm  (1<<6)  /* Input Capture Select bit 2 mask. */
#define TIM8_16_ICS2_bp  6  /* Input Capture Select bit 2 position. */

/* TIM8_16.INTMSK  bit masks and bit positions */
#define TIM8_16_OVFILVL_gm  0x03  /* Overflow Interrupt Level group mask. */
#define TIM8_16_OVFILVL_gp  0  /* Overflow Interrupt Level group position. */
#define TIM8_16_OVFILVL0_bm  (1<<0)  /* Overflow Interrupt Level bit 0 mask. */
#define TIM8_16_OVFILVL0_bp  0  /* Overflow Interrupt Level bit 0 position. */
#define TIM8_16_OVFILVL1_bm  (1<<1)  /* Overflow Interrupt Level bit 1 mask. */
#define TIM8_16_OVFILVL1_bp  1  /* Overflow Interrupt Level bit 1 position. */
#define TIM8_16_OCAILVL_gm  0x0C  /* Output Compare Match A Interrupt Level group mask. */
#define TIM8_16_OCAILVL_gp  2  /* Output Compare Match A Interrupt Level group position. */
#define TIM8_16_OCAILVL0_bm  (1<<2)  /* Output Compare Match A Interrupt Level bit 0 mask. */
#define TIM8_16_OCAILVL0_bp  2  /* Output Compare Match A Interrupt Level bit 0 position. */
#define TIM8_16_OCAILVL1_bm  (1<<3)  /* Output Compare Match A Interrupt Level bit 1 mask. */
#define TIM8_16_OCAILVL1_bp  3  /* Output Compare Match A Interrupt Level bit 1 position. */
#define TIM8_16_OCBILVL_gm  0x30  /* Output Compare Match B Interrupt Level group mask. */
#define TIM8_16_OCBILVL_gp  4  /* Output Compare Match B Interrupt Level group position. */
#define TIM8_16_OCBILVL0_bm  (1<<4)  /* Output Compare Match B Interrupt Level bit 0 mask. */
#define TIM8_16_OCBILVL0_bp  4  /* Output Compare Match B Interrupt Level bit 0 position. */
#define TIM8_16_OCBILVL1_bm  (1<<5)  /* Output Compare Match B Interrupt Level bit 1 mask. */
#define TIM8_16_OCBILVL1_bp  5  /* Output Compare Match B Interrupt Level bit 1 position. */
#define TIM8_16_ICILVL_gm  0xC0  /* Input Capture Interrupt Level group mask. */
#define TIM8_16_ICILVL_gp  6  /* Input Capture Interrupt Level group position. */
#define TIM8_16_ICILVL0_bm  (1<<6)  /* Input Capture Interrupt Level bit 0 mask. */
#define TIM8_16_ICILVL0_bp  6  /* Input Capture Interrupt Level bit 0 position. */
#define TIM8_16_ICILVL1_bm  (1<<7)  /* Input Capture Interrupt Level bit 1 mask. */
#define TIM8_16_ICILVL1_bp  7  /* Input Capture Interrupt Level bit 1 position. */

